/*
8C.js 08.01.2020
Даны два действительных числа x и y. 
Проверьте, принадлежит ли точка с координатами (xy) заштрихованному квадрату (включая его границу). 
Если точка принадлежит квадрату, выведите слово YES, иначе выведите слово NO. На рисунке сетка проведена с шагом 1.
Решение должно содержать функцию IsPointInSquare(x, y), возвращающую True, если точка принадлежит квадрату и False, 
если не принадлежит. Основная программа должна считать координаты точки, 
вызвать функцию IsPointInSquare и в зависимости от возвращенного значения вывести на экран необходимое сообщение.
Функция IsPointInSquare не должна содержать инструкцию if.
Входные данные
Вводятся два действительных числа.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
0
0
выходные данные
YES
входные данные
3
-7
выходные данные
NO
*/

function IsPointInSquare(x, y) {
    return x <= 1 && x >= -1 && y >= -1 && y <= 1;
}

var x = 3;
var y = 4;
console.log(IsPointInSquare(x, y) ? 'YES' : 'NO');