/*
8E.js 15.02.2021. 
Даны пять действительных чисел: x, y, xc, yc, r. 
Проверьте, принадлежит ли точка (x,y) кругу с центром (xc,yc) и радиусом r. 
Если точка принадлежит кругу, выведите слово YES, иначе выведите слово NO.

Решение должно содержать функцию IsPointInCircle(x, y, xc, yc, r), возвращающую True, 
если точка принадлежит кругу и False, если не принадлежит. Основная программа должна считать координаты точки, 
вызвать функцию IsPointInCircle и в зависимости от возвращенного значения вывести на экран необходимое сообщение.

Функция IsPointInCircle не должна содержать инструкцию if.

Входные данные
Вводится пять действительных чисел.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
0.5
0.5
0
0
1
выходные данные
YES
входные данные
0.5
0.5
1
1
0.1
выходные данные
NO

Функция - зависимость, при которой каждой координате точки x сопоставляется не более одной координаты y (однозначное соответствие). 
Окружность - не функция
Окружность с центром 0, 0: x^2 + y^2 == r^2
Andrey Minkevitch 19:55
(x-xc)**2 + (y-yc)**2 == r**2   Окружность
Круг: (x-xc)**2 + (y-yc)**2 <= r**2
r**2 <= (x-xc)**2 + (y-yc)**2 <= R**2
*/

function IsPointInCircle(x, y, xc, yc, r) {
    return (x - xc) * (x - xc) + (y - yc) * (y - yc) <= r * r;
}

function autoTest() {
    console.log(IsPointInCircle(0.5, 0.5, 0, 0 , 1) ? "YES" : "NO");
    console.log(IsPointInCircle(0.5, 0.5, 1, 1 , 0.1) ? "YES" : "NO");
}

autoTest();



