/*
8F.js 15.02.2021. 
Если точка принадлежит области (область включает границы), выведите слово YES, иначе выведите слово NO.

Решение должно содержать функцию IsPointInArea(x, y), возвращающую True, если точка принадлежит области и False, 
если не принадлежит. Основная программа должна считать координаты точки, 
вызвать функцию IsPointInArea и в зависимости от возвращенного значения вывести на экран необходимое сообщение.

Функция IsPointInArea не должна содержать инструкцию if.

Входные данные
Вводится два действительных числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
-2
1
выходные данные
NO
входные данные
-2
2
выходные данные
YES

Область:
внутри круга И над наклонной И над другой наклонной ИЛИ 
снаружи круга И под наклонной И под другой наклонной
*/

// Предикат: лежат ли указанные координаты внутри круга.
function IsPointInCircle(x, y, xc, yc, r) {
    return (x - xc) * (x - xc) + (y - yc) * (y - yc) <= r * r;
}

// Предикат: лежат ли указанные координаты внутри области.
function IsPointInArea(x, y) {
    let cirX = Math.abs(-1 - x);
    let cirY = Math.abs(1 - y);
    return (y >= 0 && y + x >= 0 && x <= (y / 2 - 1) && (cirX * cirX + cirY * cirY) <= 2 ||
            y < 0 && y + x <= 0 && x >= (y / 2 - 1) && (cirX * cirX + cirY * cirY) >= 2);

}



function autoTest() {
    console.log(IsPointInArea(-2, 1) ? "YES" : "NO");
    console.log(IsPointInArea(-2, 2) ? "YES" : "NO");
}

autoTest();



