/*
8G.js 15.02.2021. 
Дано действительное положительное число a и целоe число n.

Вычислите an. Решение оформите в виде функции power(a, n).

Стандартной функцией или операцией возведения в степень пользоваться нельзя.

Входные данные
Вводится действительное положительное число a и целоe число n.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
1
выходные данные
2
входные данные
2
2
выходные данные
4
*/

function power(a, n) {
    if (n == 0) {
        return 1;
    }
    return n > 0 ? power(a, n - 1) * a : power(a, n + 1) / a;
}

function autoTest() {
    console.log(power(2, 1));
    console.log(power(2, 0));
    console.log(power(2, -2));
    console.log(power(2, -10));
}

autoTest();



