'''
Дано действительное положительное число a и целоe число n.

Вычислите a^n. Решение оформите в виде функции power(a, n).

Стандартной функцией или операцией возведения в степень
пользоваться нельзя.

Входные данные
Вводится действительное положительное число a и целоe число n.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
1
выходные данные
2
входные данные
2
2
выходные данные
4

TEST 100%
'''

def power(a, n):
    answer = 1
    if n < 0: a=1 / a
    for _ in range(abs(n)):
        answer *= a
    return answer

print(power(float(input()), int(input())))

    
