'''Даны два натуральных числа n и m. Сократите дробь n/m, 
то есть выведите два других числа p и q таких, 
что n/m=q/p и дробь q/p — несократимая.

Решение оформите в виде функции ReduceFraction(n, m), 
получающая значения n и m и возвращающей кортеж из двух чисел.

Входные данные
Вводятся два натуральных числа.

Выходные данные
Выведите ответ на задачу.

mink 11/6/2020 100%

Можно вместо gcd() вызвать math.gcd().
'''

# Принимает два натуральных числа n и m.Возвращает их наибольший общий делитель.
def gcd(n,m):
    while n%m!=0:
        n, m = m,n%m 
    return m

# возвращает кортеж из двух чисел q, p.
def ReduceFraction(n,m):
    x=gcd(n,m)
    return n//x, m//x

n=int(input())
m=int(input())
print(*ReduceFraction(n,m))

    
