'''
Даны два натуральных числа n и m. Сократите дробь n/m,
то есть выведите два других числа p и q таких, что n/m=p/q и
дробь p/q — несократимая.

Решение оформите в виде функции ReduceFraction(n, m),
получающая значения n и m и возвращающей кортеж из двух чисел.

Входные данные
Вводятся два натуральных числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
12
16
выходные данные
3 4
'''

import math

def ReduceFraction(n, m):
    k = math.gcd(n, m)
    return n//k, m //k

n, m = int(input()), int(input())
print(*ReduceFraction(n, m))
