/*
8H.js 15.02.2021. 
Даны два натуральных числа n и m. Сократите дробь n/m, то есть выведите два других числа p и q таких, что n/m=p/q и дробь p/q — несократимая.

Решение оформите в виде функции ReduceFraction(n, m), получающая значения n и m и возвращающей кортеж из двух чисел.

Входные данные
Вводятся два натуральных числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
12
16
выходные данные
3 4

*/

/* НОД. Алгоритм Евклида применяется к паре целых чисел и формирует новую пару,
 которая состоит из меньшего по модулю числа и остатка от деления между модулями большего и меньшего числа. 
 Процесс повторяется, пока большее число не поделится на меньшее нацело. 
 Найденное меньшее число и есть наибольший общий делитель исходной пары.

Для двух отрицательных выдаст отрицательный НОД наибольший по модулю.
Циклится с двумя 0.
 */
function gcd(n, m) {
    while (n % m != 0) {
        [n, m] = [m, n % m];
    }
    return m;
}

function ReduceFraction(n, m) {
    return `${n / gcd(n, m)} ${m / gcd(n, m)}`;
}


function autoTest() {
    console.log(gcd(12, 16));
    console.log(gcd(-12, 16));
    // console.log(gcd(0, 0)); 
    console.log(gcd(-12, -16));
}

autoTest();




