'''
Дано натуральное число n1. Выведите его наименьший делитель, отличный от 1.

Решение оформите в виде функции MinDivisor(n). Алгоритм должен иметь сложность
O(sqrt(n)) .

Указание. Если у числа n нет делителя не превосходящего n , то число n —
простое и ответом будет само число n.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4
выходные данные
2
входные данные
5
выходные данные
5

100%
'''

def MinDivisor(n):
    for i in range(2, int(n ** 0.5) + 1):
        if n % i == 0:
            return i
    return n

n = int(input())
print(MinDivisor(n))
