/*
8J.js 01.03.2021
Дано натуральное число x>1. Проверьте, является ли оно простым. Программа должна вывести слово YES, если число простое и NO, если число составное.

Решение оформите в виде функции IsPrime(x), которая возвращает True для простых чисел и False для составных чисел. Решение должно иметь сложность O(sqrt(x)).

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
выходные данные
YES
входные данные
4
выходные данные
NO

1) Число 1 не является ни простым, ни составным.
2) Число 2 - простое.
Просто́е число́ — натуральное (целое положительное) число, имеющее ровно два различных натуральных делителя — единицу и самого себя.
ru.wikipedia.org/wiki/Простое_число
*/

function IsPrime(x) {
    if (x == 1) {   // Число 1 не является ни простым, ни составным.
        return false;
    }
    if (x == 2) {   // Число 2 - простое.
        return true;
    }
    if (x % 2 == 0) {
        return false;
    }
    let limit = Math.sqrt(x);
    for (let delitel = 3; delitel <= limit; delitel += 2) {
        if (x % delitel == 0) {
            return false;
        }
    }
    return true;
}

function autoTest() {
    console.log(IsPrime(1) ? "YES" : "NO");
    console.log(IsPrime(2) ? "YES" : "NO");
    console.log(IsPrime(3) ? "YES" : "NO");
    console.log(IsPrime(4) ? "YES" : "NO");
}

autoTest();