/*
8K.js 01.03.2021
Дано действительное положительное число a и целое неотрицательное число n. Вычислите an не используя циклы и стандартную функцию pow, а используя рекуррентное соотношение an=a⋅an−1.

Решение оформите в виде функции power(a, n).

Входные данные
Вводятся действительное положительное число a и целое неотрицательное число n.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
3
выходные данные
8
*/

function power(a, n) {
    return n == 1 ? a : a * power(a, n - 1);
}

function autoTest() {
    console.log(power(2, 3));
}

autoTest();