/*
8L.js 01.03.2021
Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

Входные данные
Вводятся два целых числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
2
выходные данные
4
*/

function sum(a, b) {
    if (b == 0) {
        return a;
    }
    return sum(a + 1, b - 1);
}

function autoTest() {
    console.log(sum(4, 5));
}

autoTest();