/*
8M.js 01.03.2021
Напишите функцию phib(n), которая по данному целому неотрицательному n возвращает n-e число Фибоначчи. В этой задаче нельзя использовать циклы - используйте рекурсию.

Входные данные
Вводится целое число.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
6
выходные данные
8
*/

function phib(n) {
    if (n == 1) {
        return 1;
    } else if (n == 0) {
        return 0;
    } else {
        return phib(n - 1) + phib(n - 2);
    }
}

function autoTest() {
    console.log(phib(6));
    console.log(phib(0));
}

autoTest();