/*
8N.js 05.03.2021
По данным числам n и k (0≤k≤n) вычислите Сkn. Для решения используйте рекуррентное соотношение C(n, k) = C(n − 1, k − 1)+ C(n − 1, k).

Решение оформите в виде функции C(n, k).

Входные данные
Вводятся целые числа n и k.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4
2
выходные данные
6

C = n!/(k! * (n - k)!)
*/

function C(n, k) {
    if (n == 0) {
        return 0;
    } else if (k == 1) {
        return n;
    } else {
        return C(n - 1, k - 1) + C(n - 1, k);
    }
}

function autoTest() {
    console.log(C(4, 2));
    console.log(C(4, 4));
    console.log(C(2, 4));
}

autoTest();
