'''
По данным числам n и k (0 <= k <= n) вычислите С(n, k).
Для решения используйте рекуррентное соотношение
C(n, k) = C(n − 1, k − 1)+ C(n − 1, k).

Решение оформите в виде функции C(n, k).

Входные данные
Вводятся целые числа n и k.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4
2
выходные данные
6

100%
'''

def C(n, k):
    return 1 if k == 0 or k == n else C(n - 1, k - 1) + C(n - 1, k)

n = float(input())
k = float(input())
print(C(n, k))
