/*
8O.js 06.02.2020
Дана последовательность чисел, завершающаяся числом 0. Найдите сумму всех этих чисел, не используя цикл.
Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания).
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
1
7
9
0
выходные данные
17
*/

function summ(n) {
   if (n == 0)
        return n;
    return n + summ(parseInt(prompt()));
}

var n = parseInt(prompt());
console.log(summ(n));