/*
8R.js 10.03.2021
Для быстрого вычисления наибольшего общего делителя двух чисел используют алгоритм Евклида. Он построен на следующем соотношении: НОД(a,b)=НОД(b,a mod b).

Реализуйте рекурсивный алгоритм Евклида в виде функции gcd(a, b).

Входные данные
Вводится два целых числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
12
14
выходные данные
2
входные данные
256
48
выходные данные
16
*/

// работает для натуральных
function gcd(a, b) {
    if (b % a == 0) {
        return a;
    } 
    return gcd(b, a % b);
}

console.log(gcd(256, 48));
console.log(gcd(13, 21));
console.log(gcd(13, 0)); // не работает
console.log(gcd(12, -6));   // не работает
console.log(gcd(-12, 6));
console.log(gcd(-12, -6)); // не работает
