/*
8S.js 22.03.2021
Постановлением ЮНЕСКО оригинал Ханойской башни был подвергнут реставрации. В связи с этим во время пользования головоломкой нельзя было перекладывать кольца с первого стержня сразу на третий и наоборот.

Решите головоломку с учетом этих ограничений. Вам не нужно находить минимальное решение, но количество совершенных перемещений не должно быть больше 200000, при условии, что количество дисков не превосходит 10.

Входные данные
Вводится натуральное число - количество колец.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
выходные данные
1 1 2
1 2 3
2 1 2
1 3 2
1 2 1
2 2 3
1 1 2
1 2 3
*/

function move(n, x, y) {
    let tmp = 6 - x - y;
    if (n == 1) {
        console.log(n, x, tmp);
        console.log(n, tmp, y);
    } else {
        move(n - 1, x, y);
        console.log(n, x, tmp);
        move(n - 1, y, x);
        console.log(n, tmp, y);
        move(n - 1, x, y);
    }
}

move(1, 1, 3);

