/*
8Y.js 29.03.2021
Дана полоска из клеток, пронумерованных от 1 до N слева направо. Разрешено снимать или ставить фишку на клетку с номером 1 или на клетку, следующую за самой левой из установленных фишек. Изначально полоска пуста. Нужно разместить фишки во всех клетках.

Входные данные
Программа получает на вход количество клеток в полоске N (1≤N≤10).

Выходные данные
Программа должна вывести последовательность номеров клеток, с которыми совершается действие. Если фишка снимается, то номер клетки должен выводиться со знаком минус. Количество действий не должно превышать 10**4. Если существует несколько возможных решений задачи, то разрешается вывести любое.

Тесты к этой задаче закрытые.

Ввод	Вывод
3
1 2 -1 3 1

4
1 2 -1 3 1 -2 -1 4 1 2

5
1 2 -1 3 1 -2 -1 4 1 2 -1 -3 1 -2 -1 5 1 2 -1 3 1 

fill(n)
Добавляем фишки на полоску до N - 1
Снимаем фишки на полоске до N - 2
Ставим фишку на поле N
Добавляем фишки на полоску до N - 2

clear(n)
Снимаем фишки на полоске до N - 2
Снимаем фишку на поле N
Добавляем фишки на полоску до N - 2
Снимаем фишки на полоске до (N - 1)

*/

// fill заполняет полоску до N, возвращает массив чисел - ответ на задачу
function fill(n) {
    if (n == 0) {
        return [];
    } 
    if (n == 1) {
        return [1];
    }
    return fill(n - 1).concat(clear(n - 2)).concat([n]).concat(fill(n - 2));
}

// сlear логически очищает полоску до N, возвращает массив числе - последовательность шагов
function clear(n) {
    if (n == 0) {
        return [];
    } 
    if (n == 1) {
        return [-1];
    } 
    return clear(n - 2).concat([-n]).concat(fill(n - 2)).concat(clear(n - 1));
}

console.log(fill(5).join(' '));