/*
8Y.js 29.03.2021
Дана полоска из клеток, пронумерованных от 1 до N слева направо. Разрешено снимать или ставить фишку на клетку с номером 1 или на клетку, следующую за самой левой из установленных фишек. Изначально полоска пуста. Нужно разместить фишки во всех клетках.

Входные данные
Программа получает на вход количество клеток в полоске N (1≤N≤10).

Выходные данные
Программа должна вывести последовательность номеров клеток, с которыми совершается действие. Если фишка снимается, то номер клетки должен выводиться со знаком минус. Количество действий не должно превышать 104. Если существует несколько возможных решений задачи, то разрешается вывести любое.

Тесты к этой задаче закрытые.

Ввод	Вывод
3
1 2 -1 3 1

*/

function move(n, x, y) {
    let tmp = 6 - x - y;
    if (n == 1) {
        console.log(n, x, tmp);
        console.log(n, tmp, y);
    } else if (n == 2) {
        move(n - 1, x, y);
        console.log(n, x, tmp);
        console.log(n - 1, y, x);
        console.log(n, tmp, y);
        move(n - 1, x, y);
    } else {
        move(n - 1, x, y);
        console.log(n, x, tmp);
        move(n - 1, y, tmp);
        console.log(n, tmp, y);
        move(n - 1, x, y);
    }
}

move(3, 1, 3);

// function move(n, x, y) {
//     let cur = x;
//     let next = 6 - cur - y;

//     if (n == 1) {
//         console.log(n, cur, next);
//         [cur, next] = [next, 6 - cur - next];
//         console.log(n, cur, next);
//     } else {
//         move(n - 1, x, y);
//         console.log(n, x, next);
//         move(n - 1, y, next);
//         console.log(n, next, y);
//         move(n - 1, next, y);
//     }
// }

// move(2, 1, 3);

console.log(4%4);   