'''
Дана полоска из клеток, пронумерованных от 1 до N слева направо.
Разрешено снимать или ставить фишку на клетку с номером 1 или на клетку,
следующую за самой левой из установленных фишек.
Изначально полоска пуста. Нужно разместить фишки во всех клетках.

Входные данные
Программа получает на вход количество клеток в полоске N (1 <= N <= 10).

Выходные данные
Программа должна вывести последовательность номеров клеток,
с которыми совершается действие. Если фишка снимается,
то номер клетки должен выводиться со знаком минус.
Количество действий не должно превышать 10^4. Если существует
несколько возможных решений задачи, то разрешается вывести любое.

Тесты к этой задаче закрытые.

Ввод
3

Вывод
1 2 -1 3 1

4
1 2 -1 3 1 -2 -1 4 1 2

5
1 2 -1 3 1 -2 -1 4 1 2 -1 -3 1 -2 -1 5 1 2 -1 3 1 

fill(n)
Добавляем фишки на полоску до N - 1
Снимаем фишки на полоске до N - 2
Ставим фишку на поле N
Добавляем фишки на полоску до N - 2

clear(n)
Снимаем фишки на полоске до N - 2
Снимаем фишку на поле N
Добавляем фишки на полоску до N - 2
Снимаем фишки на полоске до (N - 1)

Юра Багдасаров
TEST 100%
'''

# Очищает клетки на отрезке [1; n]
# При n = 0 ничего не делает
# Рекурсивно вызывает clear(n-2), print(), fill(n-2) и clear(n-1).
def clear(n): 
    if n == 1:
        print(-1, end=' ')
    if n > 1:
        clear(n - 2)
        print(-n, end=' ')
        fill(n - 2)
        clear(n - 1)

# Заполняет клетки на отрезке [1; n]
# При n = 0 ничего не делает
# Рекурсивно вызывает fill(n-1), clear(n-2),  print(n), fill(n-2).
def fill(n): 
    if n == 1:
        print(1, end=' ')
    if n > 1:
        fill(n - 1)
        clear(n - 2)
        print(n, end=' ')
        fill(n - 2)

fill(int(input()))
