'''
Дана полоска из клеток, пронумерованных от 1 до N слева направо.
Разрешено снимать или ставить фишку на клетку с номером 1 или на клетку,
следующую за самой левой из установленных фишек. Изначально полоска пуста.
Нужно разместить фишки во всех клетках.

Входные данные
Программа получает на вход количество клеток в полоске N (1 <= N <= 10).

Выходные данные
Программа должна вывести последовательность номеров клеток,
с которыми совершается действие. Если фишка снимается, то номер клетки должен
выводиться со знаком минус. Количество действий не должно превышать 10 ** 4.
Если существует несколько возможных решений задачи, то разрешается вывести
любое.

Тесты к этой задаче закрытые.

Ввод
3

Вывод
1 2 -1 3 1

4
1 2 -1 3 1 -2 -1 4 1 2

5
1 2 -1 3 1 -2 -1 4 1 2 -1 -3 1 -2 -1 5 1 2 -1 3 1 
100%

Сначала fill заполняет полоску до N.
Потом Clear логически очищает полоску до N.
И так далее.
'''

''' Принимает N - номер фишки,
с которой мы производим действия в данный момент.

Функция Clear() снимает фишки полоски от начала до N включительно.
Возвращает список - ответ на задачу.
'''
def clear(N):
    if N <= 2:
        return list(range(-N, 0))
    return clear(N - 2) + [-N] + fill(N - 2) + clear(N - 1)

''' Принимает N - Количество клеток в полоске,
которую заполняет рекурсивный вызов fill().
Эта длина будет уменьшаться при рекурсии.

Возвращает список - ответ на задачу,
Если фишка снимается, то номер клетки должен
выводиться со знаком минус.
Если ставит - со знаком плюс.
'''
def fill(N):
    if N <= 2:
        return list(range(1, N + 1))
    return fill(N - 1) + clear(N - 2) + [N] + fill(N - 2)

print(* fill(int(input())))
