'''
Задача №3814. Фишки
Дана полоска из клеток, пронумерованных от 1 до N слева направо.
Разрешено снимать или ставить фишку на клетку с номером 1 или на клетку,
следующую за самой левой из установленных фишек. Изначально полоска пуста.
Нужно разместить фишки во всех клетках.

Входные данные
Программа получает на вход количество клеток в полоске N (1≤N≤10).

Выходные данные
Программа должна вывести последовательность номеров клеток,
с которыми совершается действие. Если фишка снимается, то номер
клетки должен выводиться со знаком минус. Количество действий не
должно превышать 104. Если существует несколько возможных решений
задачи, то разрешается вывести любое.

Тесты к этой задаче закрытые.

Ввод
3
Вывод
1 2 -1 3 1
Ввод
4
Вывод
1 2 -1 3 1 -2 -1 4 1 2
Ввод
5
Вывод
1 2 -1 3 1 -2 -1 4 1 2 -1 -3 1 -2 -1 5 1 2 -1 3 1

Максимальное процессорное время	0.022	1
Максимальный расход памяти	      4063232	        9
Максимальное астрономическое время	0.024	1

100%
'''

def chips(n, isSet):
    '''displays an algorithm of filling a strip of cells with chips

    get 2 int, n is the lenth of strip, isSet define wether
    set chips(True) or remove(False) them
    '''
    
    if n > 0:
        if isSet: # поставить послоску из n фишек
            chips(n - 1, True)
            chips(n - 2, False)
            print(n, end = ' ')
            chips(n - 2, True)
        else: # убрать полоску из n фишек
            chips(n - 2, False)
            print(-n, end = ' ')
            chips(n - 2, True)
            chips(n - 1, False)
            
n = int(input())
chips(n, True)
