/*
2C.js 03.07.2020. 
Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!):

Входные данные
Вводится целое число (гарантируется, что число находится в диапазоне от -1000 до +1000).

Выходные данные
Выведите две строки, согласно образцу.
*/

let a = Number(prompt("Введите число от -1000 до 1000: "));
alert("The next number for the number " + String(a) + " is " + String(a + 1) + "\nThe previous number for the number " + String(a) + " is " + String(a - 1));
