/*
2D.js 03.07.2020. 
n школьников делят k яблок поровну, неделяющийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику?

Входные данные
Программа получает на вход числа n и k - целые, положительные, не превышают 10000.
*/

// n школьников делят k яблок поровну, функция возвращает количество яблок, которое достанется каждому школьнику.
function apples(n, k) {
    let result = Math.trunc(k/n);
    return result;
}

let n = Number(prompt('Количество школьников: '));
let k = Number(prompt('Количество яблок: '));
console.log(apples(n, k));
