'''
Длина Московской кольцевой автомобильной дороги — 109 километров.
Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час.
На какой отметке он остановится через t часов?
Без использования условных операторов эту задачу существенно проще решить на языке Python,
чем на других языках программирования.
Это связано с особенностями реализации целочисленных операций над отрицательными числами.

Входные данные
Программа получает на вход значение v и t. Если v>0,
то Вася движется в положительном направлении по МКАД, если же значение v<0,
то в отрицательном.
(Гарантируется, что исходные числа - целые и находятся в промежутке от -1000 до +1000).

Выходные данные
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.

Примеры
входные данные
60
2
выходные данные
11
входные данные
-1
1
выходные данные
108

входные данные
-108
2
выходные данные
2

входные данные
108
2
выходные данные
107

входные данные
108
3
выходные данные
106

100%
'''

v = int(input())
t = int(input())
s = v * t
print(s % 109)






      
