/*
2F_V2.js 10.07.2020. 
Длина Московской кольцевой автомобильной дороги — 109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. 
На какой отметке он остановится через t часов?
Без использования условных операторов эту задачу существенно проще решить языке Python, чем на других языках программирования. 
Это связано с особенностями реализации целочисленных операций над отрицательными числами.

Входные данные
Программа получает на вход значение v и t. Если v0, то Вася движется в положительном направлении по МКАД, 
если же значение v0, то в отрицательном.
(Гарантируется, что исходные числа - целые и находятся в промежутке от -1000 до +1000).

Выходные данные
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.
входные данные
60      -1      -108    108     108
2        1         2      2       3
выходные данные
11     108         2    107     106
*/

// Байкер Вася едет со скоростью v t часов. Длина МКАД — 109 километров. Функция возвращает отметку на которой остановился мотоциклист.
function speedTime(v, t) {
        const round = 109;
        let distance = v * t;
        return ((round + distance % round)) % round;
}

const v = 60;
const t = 2;
const mark = speedTime(v, t); // speedTime(Number(prompt('Введите скорость, км/ч: ')), Number(prompt('Введити время движения, ч: ')));
console.log(mark);

