'''дано целое число n. Выведите следующее за ним четное число
Входные данные
Вводится целое положительное число, не превышающее 1000.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
7
выходные данные
8
входные данные
8
выходные данные
10'''
number = int(input())
result = number + 2 - number % 2
print(result)
