/*
2L.js 10.07.2020. 
Обувная фабрика собирается начать выпуск элитной модели ботинок. Дырочки для шнуровки будут расположены в два ряда, 
расстояние между рядами равно a, а расстояние между дырочками в ряду b. Количество дырочек в каждом ряду равно N. 
Шнуровка должна происходить элитным способом “наверх, по горизонтали в другой ряд, наверх, по горизонтали и т.д.” (см. рисунок). 
Кроме того, чтобы шнурки можно было завязать элитным бантиком, длина свободного конца шнурка должна быть l. 
Какова должна быть длина шнурка для этих ботинок?

Входные данные
Программа получает на вход четыре натуральных числа a, b, l и N.    

Выходные данные
Программа должна выводить одно число – искомую длину шнурка.

входные данные
2
1
3
4
выходные данные
26
*/

// Функция возвращает длину шнурка с параметрами a b l N
let a = 2;
let b = 1;
let l = 3;
let N = 4;
const L = 2 * ((N - 1) * (a + b) + l) + a;
console.log(L);
