/*
2M.js 10.07.2020. 
В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов.
Выведите наименьшее число парт, которое нужно приобрести для них.

Входные данные
Программа получает на вход три натуральных числа: количество учащихся в каждом из трех классов (числа не превышают 1000).

Выходные данные
Выведите ответ на задачу.

входные данные
20          16
21          18
22          20
выходные данные
32          27
*/

// Функция возвращает количесво парт l для новых классов с количеством учеников: a, b, c
let a = 16;
let b = 18;
let c = 20;

const l = Math.ceil(a / 2) + Math.ceil(b / 2) + Math.ceil(c / 2);
console.log(l)