'''В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для
них новыми партами. За каждой партой может сидеть два учащихся.
Известно количество учащихся в каждом из трех классов.
Выведите наименьшее число парт, которое нужно приобрести для них.

Программа получает на вход три натуральных числа: количество учащихся в каждом и
з трех классов.'''

a=int(input('Введите количество учащихся в 1 классу: '))
b=int(input('Введите количество учащихся в 2 классу: '))
c=int(input('Введите количество учащихся в 3 классу: '))
print((a+1)//2+(1+b)//2+(1+c)//2)

