/*
2N.js 10.07.2020. 
Дано число n. С начала суток прошло n минут. Определите, сколько часов и минут будут показывать электронные часы в этот момент.

Входные данные
Вводится число n - целое, положительное, не превышает 107.

Выходные данные
Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59).

Учтите, что число n может быть больше, чем количество минут в сутках.

входные данные
150         1441
выходные данные
2 30        0 1        
*/

// Программа выводит количество часов и минут, прошедших с начала суток за n минут
let n = 150;
let hour = 24;
let minute = 60;
let hours = Math.trunc(n / minute);
let minutes = n % minute;
console.log(hours, minutes);