/*
2O.js 23.03.2019
Электронные часы показывают время в формате h:mm:ss, то есть сначала записывается количество часов в диапазоне от 0 до 23, 
потом обязательно двузначное количество минут, затем обязательно двузначное количество секунд. 
Количество минут и секунд при необходимости дополняются до двузначного числа нулями.

С начала некоторых суток прошло n секунд. Выведите, что покажут часы. 
Задачу необходимо решить без использования условных операторов (в том числе без тернарного оператора ?: в С++) и\или циклов.

Входные данные
Вводится число n - целое, положительное, не превышает 10^7.

Выходные данные
Выведите показания часов, соблюдая формат.

Примеры
входные данные
3602
выходные данные
1:00:02
входные данные
129700
выходные данные
12:01:40
*/
var n = 3602;
n = n%(3600*24); // число секунд с начала последних суток. 
var hour = Math.trunc(n/3600);
var min = Math.trunc(n%3600/60);
var sec = n%60;
console.log(String(hour) + ':' + String(Math.trunc(min/10))+ String(min%10) + ':' + String(Math.trunc(sec/10)) + String(sec%10));