/*
2P.js 13.07.2020. 
Напишите программу, которая считывает значения двух переменных a и b, затем меняет их значения местами (то есть в переменной a должно быть записано то,
что раньше хранилось в b, а в переменной b записано то, что раньше хранилось в a). Затем выведите значения переменных.

Выходные данные
Выведите показания часов, соблюдая формат.

входные данные
8
5
выходные данные
5 8
*/

// Программа меняет значения a, b местами
let a = 8;
let b = 5;
let c = {
    a: a,
    b: b
};
 b = c.a;
 a = c.b;
console.log(a, b);

