/*
Напишите программу, которая считывает значения двух переменных a и b, затем меняет их значения местами (то есть в переменной a должно быть записано то, что раньше хранилось в b, а в переменной b записано то, что раньше хранилось в a). Затем выведите значения переменных.

Входные данные
Вводятся два целых числа (гарантируется, что числа находятся в промежутке от -1000 до +1000).

Выходные данные
Выведите ответ на задачу.

Примечание
Решением задачи не является такой код:

ввод (a)
ввод (b)
вывод (b, a)
Примеры
входные данные
8
5
выходные данные
5 8
*/
var a = parseInt(prompt('Введите число,в промежутке от -1000 до +1000'));
var b = parseInt(prompt('Введите число,в промежутке от -1000 до +1000'));
var temp = a; // обмен через буфер
a = b;
b = temp;
console.log(a,b);