/*
2Q.js 13.07.2020. 
Напишите программу, которая считывает значения двух переменных a и b, затем меняет их значения местами (то есть в переменной a должно быть записано то,
что раньше хранилось в b, а в переменной b записано то, что раньше хранилось в a). Затем выведите значения переменных.
Решите задачу без использования дополнительной переменной.

Выходные данные
Выведите показания часов, соблюдая формат.

входные данные
8
5
выходные данные
5 8
*/

// Программа меняет значения a, b местами
let a = 58;
let b = 33;
a = a + b;
b = a - b;
a = a - b;
console.log(a, b);

