/*
2R.js 13.07.2020. 
В некоторой школе занятия начинаются в 9:00. Продолжительность урока — 45 минут, после 1-го, 3-го, 5-го и т.д. уроков перемена 5 минут, а после 2-го, 
4-го, 6-го и т.д. — 15 минут.

Входные данные
Дан номер урока (число от 1 до 10). Определите, когда заканчивается указанный урок.

Выходные данные
Выведите два целых числа: время окончания урока в часах и минутах.

входные данные
3
выходные данные
11 35

уроков 	Коротких	Длинных
1		0			0
2       1           0
3       1           1
4       2           1
5       2           2
6       3           2
7       3           3
*/

let num = 3;
let minutes = 45 * num + 15 * (Math.trunc((num - 1) / 2)) + 5 * Math.trunc(num / 2); // количество минун на num уроков и перемен между ними
console.log(9 + Math.trunc(minutes/60), minutes%60);




