'''
В некоторой школе занятия начинаются в 9:00.
Продолжительность урока — 45 минут, после 1-го, 3-го, 5-го и т.д.
уроков перемена 5 минут, а после 2-го, 4-го, 6-го и т.д. — 15 минут.

Входные данные
Дан номер урока (число от 1 до 10).
Определите, когда заканчивается указанный урок.

Выходные данные
Выведите два целых числа: время окончания урока в часах и минутах.

Примеры
входные данные
3
выходные данные
11 35

Уроков: Перемен:
number короткая длинная
0      0        0
1      0        0
2      1        0
3      1        1
4      2        1
5      2        2
6      3        2
7      3        3
'''

number = int(input())
korotkie = number // 2
dlinnie = number - korotkie - 1
time = number * 45 + korotkie * 5 + dlinnie * 15
print(time // 60 + 9, time % 60)
