/*
2T.js 16.07.2020. 
Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени.
Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.

Входные данные
Программа на вход получает три целых числа: часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй момент времени.
1           1
1           2
1           30
2           1
2           3
2           20
Выходные данные
Выведите число секунд между этими моментами времени.
3661       50
*/

let a1 = 1;     // количество часов 1 момента
let b1 = 2;     // количество минут 1 момента
let c1 = 30;    // количество секунд 1 момента
let a2 = 1;     // количество часов 2 момента
let b2 = 3;     // количество минут 2 момента
let c2 = 20;    // количество секунд 2 момента

console.log((a2 * 3600 + b2 * 60 + c2) - (a1 * 3600 + b1 * 60 + c1));




