/*
2T.js 23.03.2019
Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, 
минуты и секунды для каждого из моментов времени. Известно, 
что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.

Входные данные
Программа на вход получает три целых числа: часы, минуты, секунды, 
задающие первый момент времени и три целых числа, задающих второй момент времени.

Выходные данные
Выведите число секунд между этими моментами времени.

Примеры
входные данные
1
1
1
2
2
2
выходные данные
3661
входные данные
1
2
30
1
3
20
выходные данные
50
*/
var h1 = 1;
var m1 = 2;
var s1 = 30;
var h2 = 1;
var m2 = 3;
var s2 = 20;
console.log((h2-h1)*3600 + (m2 - m1)*60 + s2-s1);