'''За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? 
Входные данные 
Программа получает на вход числа n и m (целые, положительные). 
Выходные данные 
Выведите ответ на задачу.

Алгоритм: по смысле задачи, m/n нужно округлить вверх.
Существуют 3 test case:

1) 199//100+1
2
2) 200//100
2
3) 201//100+1
3

Таким образом,нужно к m//n прибавить 1, только если m%n!=0.
В остальных случаях нужно прибавить 0.

mink 100%
'''
n = int(input())
m = int(input())
print(m//n + int(m%n!=0))
