"""За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршут длиной m километров? 
 Входные данные 

Программа получает на вход числа n и m (целые, положительные). 
 Выходные данные 

Выведите ответ на задачу.
Примеры
Входные данные
700
750
Выходные данные
2
Входные данные
700
2100
Выходные данные
3

Пояснение:
прибавляем к числителю ЗНАМЕНАТЕЛЬ МИНУС 1.
Получаем округление дроби вверх.
(Дробь в данной задаче - целочисленное деление двух целых чисел).

100%
"""
n=int(input('введите сколько километров за день проезжает машина: '))
m=int(input('введите длину маршрута: '))
print((m+n-1)//n)
