/*
2W.js 17.07.2020. 
Улитка ползет по вертикальному шесту высотой h метров, поднимаясь за день на a метров, а за ночь спускаясь на b метров. 
На какой день улитка доползет до вершины шеста?

Входные данные
Программа получает на вход натуральные числа h, a, b.
10
3
2
Выходные данные
Программа должна вывести одно натуральное число. Гарантируется, что ab.
8
*/

let h = 10;     // высота шеста
let a = 3;     // расстояние за день
let b = 2;    // расстояние за ночь
console.log(Math.trunc((h - a) / (a - b)) + 1);




