/*
2X.js 17.07.2020. 
Дано четырехзначное число. Определите, является ли его десятичная запись симметричной. Если число симметричное, то выведите 1, 
иначе выведите любое другое целое число. Число может иметь меньше четырех знаков, тогда нужно считать, что его десятичная запись 
дополняется слева незначащими нулями.

Входные данные
Вводится единственное число.
2002
Выходные данные
Выведите ответ на задачу.
1
*/

let a = 1000;     // введите число

let sum1_2 = Math.trunc(a / 100);    // расстояние за ночь
let sum4 = a % 10;
let sum3 = Math.trunc(a % 100 / 10);
[sum4, sum3] = [sum3, sum4];
console.log(Math.trunc(sum1_2 / Number(String(sum3) + String(sum4))) + (Number(String(sum3) + String(sum4))) % (2 * sum1_2));

let b = 0;
let c = 3;
console.log(b % c);




