/*
7B.js 03.01.2021. 
Дано целое число, не меньшее 2. Выведите его наименьший простой делитель.

Входные данные
Вводится целое положительное число N≤2∗10^9.
15

Выходные данные
Выведите ответ на задачу.
3 
Порядок роста по вреимени O(N^1/2)
Алгоритм: имеется 2 случая.
1) Число не простое
    Наименьший делитель будет обнаружен не доходя до корня из N.
    Прерываем цикл, возвращаем наименьший делитель.
2) Число простое
    Делитель не будет обнаружен до корня из N
    Прерываем цикл, возвращаем N.
Следовательно из цикла должно быть 2 РАЗЛИЧНЫХ выхода.
*/

// возвращает наименьший простой делитьель N за O(sqrt(N)).
function processing(N) { 
    if (N % 2 == 0) 
        return 2;
    let limit = Math.sqrt(N);  // предел, до которого проверяем делитель
    let delitel = 3;  // delitel
    while (delitel <= limit) { // второй выход, делитель не найден
        if (N % delitel == 0) { // найден делитель
            return delitel; // первый выход, делитель найден.
        } 
        delitel += 2;
    }
    return N; 
}

function interfaceTest() {
    console.log(processing(121));
}

interfaceTest();



