/*
7D.js 07.01.2021. 
Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
3       8

Выходные данные
Выведите ответ на задачу.
NO      YES

Если число - степень двойки
1) 1000 - 1 = 0111
2) 1000 | 0111 = 1111
3) 1000 << 1 = 10000
4) 10000 - 1 = 01111
5) 1111 == 1111
*/

function processing(N) {
    let left = N | (N - 1);
    let right = (N << 1) - 1;
    return left == right;
}

function interfaceTest() {
    console.log(processing(6) ? "YES" : "NO");
}

interfaceTest();



