/*
7D.js 07.01.2021. 
Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
3       8

Выходные данные
Выведите ответ на задачу.
NO      YES

2^N = 1 единица и N нулей (2) - А если число НЕ степень 2, то это НЕ 1 с N нулями.
2^N-1 = N единиц (2) - А если число НЕ степень 2, то НЕ получим все 1, а получим 1 и 0.
*/

// предикат
function processing(N) {
    return (N & (N - 1)) == 0;
}

function interfaceTest() {
    console.log(processing(15) ? "YES" : "NO");
}

interfaceTest();



