/*
7D.js 03.01.2021. 
Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
3       8

Выходные данные
Выведите ответ на задачу.
NO      YES
4   3   
Алгоритм для целых чисел, работает быстрее для НЕ степений двойки
1) Направление вниз пока N делится на 2
2) В цикле N делим нацело на 2, пока N делится на 2 
3) Проверяем степень двойки как равенство N == 1
*/

function processing(N) {
    while (N % 2 === 0) {
        N = Math.trunc(N / 2);
    }
    return N == 1;
}

function interfaceTest() {
    console.log(processing(3) ? "YES" : "NO");
}

interfaceTest();



