/*
7D.js 03.01.2021. 
Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
3       8

Выходные данные
Выведите ответ на задачу.
NO      YES
4   3   
Решает для чисел с плавающей точкой
1) Направление от N вниз до 1
2) В цикле N делим на 2, пока N > 1
3) Проверяем степень двойки как равенство N == 1 
*/

function processing(N) {
    while (N > 1) {
        N /= 2;
    }
    return N == 1;
}

function interfaceTest() {
    console.log(processing(4) ? "YES" : "NO");
}

interfaceTest();



