/*
7D.js 03.01.2021. 
Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
3       8

Выходные данные
Выведите ответ на задачу.
NO      YES

Степень двойки в двоичной ССч:
0001
0010
0100
1000
...
Сравнить полученное число, с 1, сдвинутой побитово влево на длину числа N в двоичной записи
*/

function processing(N) {
    let N_2 = N.toString(2);
    let exp = 1;
    exp <<= N_2.length - 1;
    return N == exp;
}

function interfaceTest() {
    console.log(processing(128) ? "YES" : "NO");
}

interfaceTest();


