/*
7D.js 03.01.2021. 
Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, 
или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
3       8

Выходные данные
Выведите ответ на задачу.
NO      YES

1) Если число нечётное, то оно не может быть степенью двойки
2) Если число является степенью двойки, возвращаем true.
    
*/

function processing(N) {
    if (N % 2 != 0) 
        return false;
    let i = 1;
    while (i <= N) {
        if (N % i == 0) {
            return true;
        }
        i *= 2;
    }
    return false;
}

function interfaceTest() {
    console.log(processing(1025) ? "YES" : "NO");
}

interfaceTest();



