/*
7E.js 03.01.2021. 
По данному натуральному числу N выведите такое наименьшее целое число k, что 2^k≥N.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.
7

Выходные данные
Выведите ответ на задачу.
3
1) Делить N на 2, пока не получим 1
   Прерываем цикл, возвращаем количество шагов 
*/

function processing(N) {
    let k = 0;
    while (N > 1) {
        N = Math.ceil(N / 2); // нечётные числа округляем вверх
        k++;
    }
    return k;
}

function interfaceTest() {
    console.log(processing(9));
}

interfaceTest();



