/*
7F.js 03.01.2021. 
В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 10% от предыдущего значения. 
По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.

Входные данные
Программа получает на вход действительные числа x и y
10
20

Выходные данные
Программа должна вывести одно натуральное число.
9
*/

function processing(x, y) {
    let day = 1;
    while (x < y) {
        day++;
        x += x / 10;
    }
    return day;
}

function interfaceTest() {
    console.log(processing(0.00001, 0.00002));
}

interfaceTest();



