/*
7H.js 04.11.2019
Программа получает на вход последовательность целых неотрицательных чисел, 
каждое число записано в отдельной строке. 
Последовательность завершается числом 0, при считывании которого программа должна закончить свою работу 
и вывести количество членов последовательности (не считая завершающего числа 0).
Числа, следующие за числом 0, считывать не нужно.
Входные данные
Вводится последовательность целых чисел, заканчивающаяся числом 0.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
1
7
9
0
5
выходные данные
3
*/
var count = 0;
var n = parseInt(prompt());
while (n != 0) {
    ++count;
    n = parseInt(prompt());
}
console.log(count);