/*
7H.js 04.01.2021. 
Программа получает на вход последовательность целых неотрицательных чисел, каждое число записано в отдельной строке. 
Последовательность завершается числом 0, при считывании которого программа должна закончить свою работу и вывести 
количество членов последовательности (не считая завершающего числа 0).

Числа, следующие за числом 0, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, заканчивающаяся числом 0.
1
7
9
0
5

Выходные данные
Выведите ответ на задачу.
3
*/

let cnt = 0; 
while (parseInt(prompt('Число') != 0)) {
    cnt++;
}
console.log(cnt);







