/*
7J.js 05.01.2021. 
Определите среднее значение всех элементов последовательности, завершающейся числом 0.

Использовать массивы в данной задаче нельзя.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания.
1
7
9
0
Выходные данные
Выведите ответ на задачу.
5.66666666667
*/

let sum = 0;    // сумма элементов последовательности
let cnt = 0;    // количесво элементов последовательности
let num = parseInt(prompt('Введите число'));    // первое число последовательности
while(num != 0) {
    sum += num;
    cnt++;
    num = parseInt(prompt('Введите число')); // следующее число последовательнсти
} 
console.log(sum / cnt); // среднее арифметическое




