/*
7K.js 05s.01.2021. 
Определите количество четных элементов в последовательности, завершающейся числом 0.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания).

Выходные данные
2
1
4
0
Выведите ответ на задачу.
2
*/

let cnt = 0;
let num = parseInt(prompt('Введите число'));
while(num != 0) {
    if (num % 2 == 0) {
        cnt++;
    }
    num = parseInt(prompt('Введите число'));
}
console.log(cnt); 




