/*
7M.js 06.01.2021. 
Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, сколько элементов этой последовательности больше предыдущего элемента.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания).
1
7
9
0
Выходные данные
Выведите ответ на задачу.
2
*/

let cnt = 0;
let num = parseInt(prompt('Введите число'));    // вводим первое число
let pre = num;                                  // предыдущее число
while(num != 0) {
    num = parseInt(prompt('Введите число'));    // вводим текущее число
    if (pre < num) {
        cnt++;
    }
    pre = num;
} 

console.log(cnt);




