/*
7M.js 15.11.2019
Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, сколько элементов этой последовательности больше предыдущего элемента.
Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания).
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
1
7
9
0
выходные данные
2
не работает для последовательности 0 длины
*/
var count = 0;
var elem = parseInt(prompt());
var n = parseInt(prompt());
while (n != 0) {
    if (n > elem) {
        count++;
    }
    elem = n;
    n = parseInt(prompt());    
}
console.log(count);