/*
7N.js 06.01.2021. 
Последовательность состоит из различных натуральных чисел и завершается числом 0. 
Определите значение второго по величине элемента в этой последовательности.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания).
1
7
9
0
Выходные данные
Выведите ответ на задачу.
7 
6
0
ответ
6
Поиск второго максимума: обязательно отличается по величине от первого.
(max2 отличается от max1 и по номеру и по значению)
*/
let num = 1;
let max1 = 0;
let max2 = 0;
while(num != 0) {
    num = parseInt(prompt('Введите число'));
    if (num > max1) { // num - первый максимум
        max2 = max1; // алгоритм перехода
        max1 = num;
    } else if (num > max2) {
        max2 = num;
    }
    console.log(max1, max2, num);
}
//console.log(max2);
console.log(max2>0 ? ""+max2 : "No");




