'''
Последовательность состоит из различных натуральных чисел
и завершается числом 0.
Определите значение второго по величине элемента в этой последовательности.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0
(само число 0 в последовательность не входит, а служит как признак ее окончания).

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
7
9
0
выходные данные
7


Элементы последовательности _ не могут_ быть одинаковыми!
алгоритм поиска 2-го макс(2-го по величине элемента
Если мы вводим число больше чем max1, заменяем их.
Если число в промежутке между max2 и max1, то заменяем только max2.

100%, только для 7N, не работает для 7O
'''

max1 = max2 = 0
item = 1
while item != 0:
    item = int(input())
    if item > max1:
        max1, max2 = item, max1
    if item > max2 and item < max1:
        max2 = item 
print(max2)

