'''
Последовательность состоит из натуральных чисел и завершается числом 0.
Определите значение второго по величине элемента в этой последовательности,
то есть элемента, который будет наибольшим,
если из последовательности удалить наибольший элемент.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0
(само число 0 в последовательность не входит, а служит как признак ее окончания).

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
7
9
0
выходные данные
7

TEST 100%   (и как 7N 100%)
'''

num = firstMax = int(input())
secondMax  = 0
while num != 0:
    num = int(input())
    if num >= firstMax: # Больше или равно
        firstMax, secondMax = num, firstMax
    elif num > secondMax:
        secondMax = num
print(secondMax)
