/*
7P.js 06.01.2021. 
Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, какое количество элементов этой последовательности, равны ее наибольшему элементу.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).
1       1
7       3
9       3
0       1
        0
Выходные данные
Выведите ответ на задачу.
1       2
*/

let num = parseInt(prompt('Введите число'));
let cnt = 1;
let max = 0;
while(num != 0) {
    if (max < num) {            // если текущее число больше max, то записываем его в max
        max = num;
        cnt = 1;                // это первое число в таким значением
    } else if (max == num) {    // увеличиваем счётчик, когда максимум повторяется
        cnt++;
    }
    num = parseInt(prompt('Введите число'));
}
console.log(cnt);




