/*
7Q.js 22.01.2021. 
Найдите сумму последовательности натуральных чисел, 
если признаком окончания последовательности является два подряд идущих числа 0. 
Числа стоящие после двух нулей в решении задачи участвовать не должны.

Входные данные
Вводится последовательность целых чисел.
1
0
7
0
9
0
0
5
Выходные данные
Выведите ответ на задачу.
17

*/


let prev = 1, next = 1, sum = 0;
while (prev + next != 0) {  // пока оба значение не нули
    prev = next;
    // console.log(prev, next, sum);
    next = parseInt(prompt('Введите число'));
    sum += next;
}
console.log(sum);


