/*
7Q.js 22.01.2021. 
Найдите сумму последовательности натуральных чисел, 
если признаком окончания последовательности является два подряд идущих числа 0. 
Числа стоящие после двух нулей в решении задачи участвовать не должны.

Входные данные
Вводится последовательность целых чисел.
1
0
7
0
9
0
0
5
Выходные данные
Выведите ответ на задачу.
17

1) Записываем последовательность ввода в массив данных (не понятно, как остановить prompt, если после 2ух нулей могут вводиться числа).
2) Находим сумму элементов массива, пока не встретим 2 подряд 0.
*/


function processing(input) {
    let i = 0;
    let sum = 0;
    let cnt = 0; // количество нулевых значений подряд
    while (cnt < 2) {
        if (input[i] == 0) {
            cnt++;
        } else {
            cnt = 0;
        }
        sum += input[i];
        i++;
    }
    return sum;
}

function interfaceTest() {
    console.log(processing([1, 0, 7, 0, 9, 0, 0, 5]));
}

interfaceTest();
