/*
7Q.js 22.01.2021. 
Найдите сумму последовательности натуральных чисел, 
если признаком окончания последовательности является два подряд идущих числа 0. 
Числа стоящие после двух нулей в решении задачи участвовать не должны.

Входные данные
Вводится последовательность целых чисел.
1
0
7
0
9
0
0
5
Выходные данные
Выведите ответ на задачу.
17
*/


let input = parseInt(prompt('Введите число'));
let sum = 0;
let cnt = 0; // количество нулевых значений подряд
while (cnt < 2) {
    cnt = input == 0 ? cnt + 1 : 0; 
    sum += input;
    // console.log(input, sum, cnt);
    input = parseInt(prompt('Введите число'));
}
console.log(sum);


