'''    
Найдите сумму последовательности натуральных чисел, если признаком окончания последовательности является два подряд идущих числа 0.
Числа стоящие после двух нулей в решении задачи участвовать не должны.

Входные данные
Вводится последовательность целых чисел.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
0
7
0
9
0
0
5
выходные данные
17

100%
'''
    
prevterm=int(input())
term=int(input())
sum=prevterm
while not(term==0 and prevterm==0):
    sum+=term
    prevterm=term
    term=int(input())
print(sum)
