'''
Найдите сумму последовательности натуральных чисел, если признаком окончания
последовательности является два подряд идущих числа 0. Числа стоящие после
двух нулей в решении задачи участвовать не должны.

Входные данные
Вводится последовательность целых чисел.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
0
7
0
9
0
0
5
выходные данные
17

TEST 100%
'''

new = summa = int(input())
old = int(new == 0)
while not (old == new == 0):
    new, old = int(input()), new
    summa += new
print(summa)
