'''
Последовательность Фибоначчи определяется так:
f(0) = 0; f(1) = 1; f(n) = f(n - 1) + f(n - 2)
По данному числу n определите n-е число Фибоначчи n.

Входные данные
Вводится натуральное число n.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
6
выходные данные
8

TEST 100%
'''

n = int(input())
f0 = 0
f1 = 1
while n > 0:
    f0, f1 = f1, f0 + f1
    n -= 1
print(f0)
