/*
7U.js 26.01.2021. 
Дана последовательность натуральных чисел, завершающаяся числом 0. 
Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, 
а служит как признак ее окончания).
1
7
7
9
1
0
Выходные данные
Выведите ответ на задачу.
2

0) Processing получает массив данных от interface
1) Если текущее число равно предыдущему, увеличиваем счётчик
    Если счётчик стал больше максимума, то максимум равен счётчику
2) Если текущее число не равно предыдущему, сбрасываем счётчик
3) Возвращаем максимум
*/


function processing(input) {
    let cnt = 1;
    let max = 1;
    for (let i = 1; i < input.length; i++) {
        if (input[i] == input[i - 1]) { // значение i - 1 для i = 1 существует, так как цикл начинается с 1
            cnt++;
            if (max < cnt) {
                max = cnt;
            }
        } else {
            cnt = 1;
        }
    }
    return max;
}

function interface() {
    let intefaceInput = [];
    let input = prompt('Введите первое число');
    while (input != '0') {
        intefaceInput.push(input);  // заполняем массив данных
        input = prompt('Введите число');
    }
    return processing(intefaceInput);
}

interface();





