'''
Дана последовательность натуральных чисел, завершающаяся число 0.
Определите наибольшую длину монотонного фрагмента последовательности
(то есть такого фрагмента, где все элементы либо больше предыдущего,
либо меньше).

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0
(само число 0 в последовательность не входит, а служит как признак ее окончания).

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
7
7
9
1
0
выходные данные
2

TEST 100%
'''

old = new = int(input())
maximum = 0
count = 1
direction = True # True - возрастание, False - убывание
while new != 0:
    if new > old: # Последовательность возрастает
        if direction: # Последовательность продолжает возрастать
            count += 1
        else: # Последовательность начала возрастать
            count = 2
        direction = True
    elif new < old: # Последовательность убывает
        if not direction: # Последовательность продолжает убывать
            count += 1
        else: # Последовательность начала убывать
            count = 2
        direction = False
    else: # Последовательность не возрастает и не убывает
        count = 1
    if maximum < count:
        maximum = count
    old = new
    new = int(input())
print(maximum)
