'''    
Дана последовательность натуральных чисел, завершающаяся число 0.
Определите наибольшую длину монотонного фрагмента последовательности
(то есть такого фрагмента, где все элементы либо больше предыдущего, либо меньше).

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0
(само число 0 в последовательность не входит,а служит как признак ее окончания).

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
7
7
9
1
0
выходные данные
2

два счетчика count1,2; код для воз последовательности влияет только на cnt1,
а для уб - только на cnt2
int(input()) в конце цикла
100%
'''
    
max1=1
max2=1
count1=1
count2=1
term=int(input())
prevterm=term
while term!=0:
    if prevterm<term: # возрастающие отрезки
        count1+=1
    else:
        if count1>max1: max1=count1
        count1=1
    if prevterm>term: # убывающие отрезки
        count2+=1
    else:
        if count2>max2: max2=count2
        count2=1
    prevterm=term
    term=int(input())
if count1>max1: max1=count1
if count2>max2: max2=count2  
print(max(max1,max2))
