/*
7W.js 30.01.2021. 
Элемент последовательности называется локальным максимумом, 
если он строго больше предыдущего и последующего элемента последовательности. 
Первый и последний элемент последовательности не являются локальными максимумами.

Использовать массивы в данной задаче нельзя.

Дана последовательность натуральных чисел, завершающаяся числом 0. 
Определите количество строгих локальных максимумов в этой последовательности.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, 
а служит как признак ее окончания).
1
2
1
2
1
0
Выходные данные
Выведите ответ на задачу.
2

1) Если текущее число больше предыдущего
    Увеличиваем счётчик
2) Если текущее число меньше предыдущего
    Если счётчик > 0, то увеливаем количество максимумов на 1
    Сбрасываем счётчик
3) Выводим количество максимумов
*/

function processing() {
    let elem = prev2 = prev1 = parseInt(prompt('Введите число'));
    let cnt = 0;
    while (elem != 0) {
        if (prev1 > prev2 && prev1 > elem ) {  // prev1 максимум
            cnt++;
        }
        [prev2, prev1, elem] = [prev1, elem, parseInt(prompt('Введите число'))];
    }
    return cnt;
}

processing();

// function interfaceTest() {
//     console.log(processing());
// }

// interfaceTest();

// function autoTest() {
//     console.log(processing(0)); // 0            0
//     console.log(processing(1)); // 1 || 2       2
//     console.log(processing(2)); // 3            3
//     console.log(processing(8)); // 6            6
//     console.log(processing(6)); // -1          -1
//     console.log(processing(13)); // 7           7
// }

// autoTest();

