/*
7X.js 26.12.2019
Определите наименьшее расстояние между двумя локальными максимумами последовательности натуральных чисел, 
завершающейся числом 0. Локальным максимумом называется такое число в последовательности, которое больше своих соседей. 
Если в последовательности нет двух локальных максимумов, выведите число 0.
Начальное и конечное значение при этом локальными максимумами не считаются.
Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 
(само число 0 в последовательность не входит, а служит как признак ее окончания).
Выходные данные
Выведите ответ на задачу.
Пояснение к тестам:
В первом тесте локальными максимумами являются все двойки (они больше соседей). Между последними - расстояние наименьшее.
Во втором тесте нет локального максимума.
Примеры
входные данные
1
2
1
1
2
1
2
1
0
выходные данные
2
входные данные
1
2
3
0
выходные данные
0
*/ 

var prev = parseInt(prompt());
var curn = parseInt(prompt());
var next = parseInt(prompt());
var distance = 0; // Текущее расстояние между локальными максимумами.
var minDist = 0; // Минимальное расстояние между локальными максимумами.
var maxCount = 0; // Счетчик количества максимумов.
while (next != 0) {
    if (curn > next && curn > prev && next != 0) { // Найден локальный максимум.
        maxCount++;
        if (distance < minDist || minDist == 0) // Поиск минимума ИЛИ инициализация minDist.
            minDist = distance;
        distance = 1; // Для следующего шага.
    }
    else if (maxCount > 0) {    // Если локальный максимум был найден.
        distance+=1;
    }
    prev = curn;
    curn = next;
    next = parseInt(prompt());
}
console.log(maxCount < 2 ? 0 : minDist);