'''    
У исполнителя “Водолей” есть два сосуда, первый объемом A литров, второй объемом B литров, а также кран с водой. Водолей может выполнять следующие операции:

Наполнить сосуд A (обозначается >A).
Наполнить сосуд B (обозначается >B).
Вылить воду из сосуда A (обозначается A>).
Вылить воду из сосуда B (обозначается B>).
Перелить воду из сосуда A в сосуд B (обозначается как A>B).
Перелить воду из сосуда B в сосуд A (обозначается как B>A).
Команда переливания из одного сосуда в другой приводят к тому,
что либо первый сосуд полностью опустошается, либо второй сосуд полность наполняется.

Входные данные
Программа получает на вход три натуральных числа A, B, N, не превосходящих 10^4.

Выходные данные
Необходимо вывести алгоритм действий Водолея, который позволяет получить в точности N литров в одном из сосудов,
если же такого алгоритма не существует, то программа должна вывести текст Impossible.

Количество операций в алгоритме не должно превышать 10**5. Гарантируется, что если задача имеет решение,
то есть решение, которое содержит не более, чем 10**5 операций.

Тесты к этой задаче закрытые.

Примеры
входные данные
3
5
1
выходные данные
>A
A>B
>A
A>B
входные данные
3
5
6
выходные данные
Impossible

Однонаправленный алгоритм.
1) наполнить а, перелить в b, повторять, пока остаток b не станет меньше а
2) наполнить b до предела, опустошить b, вылить в b остаток из а
3) если не получено n, повторять, пока оно не будет получено или не будет превышен предел числа операций
Алгоритм без памяти - путь не запоминается.

Максимальное процессорное время	        0.069	       69
Максимальный расход памяти	        14802944       63
Максимальное астрономическое время	0.074	       69

100%
'''
    
a=int(input())
b=int(input())
n=int(input())
k=0
Va=0
Vb=0
min='A'
max='B'
LIMIT = 10**5 # предельное количество оборотов цикла
if a>b: # A всегда меньше B
    a,b=b,a
    min,max=max,min
while k<LIMIT: #проверка возможности получения n литров
    k+=2
    if b-Vb>=a:
        Vb+=a        
    else:
        Vb=a-(b-Vb)
        k+=2
    if Vb==n:
        flag=1
        break
else:
    print('Impossible')
    exit(0)
Vb=0 # Вернем начальное состояние системы (a и b не менялись).
while n!=Vb: # 2 цикл - печать результата
    print('>',min, sep='') 
    print(min, '>', max, sep='')    
    if b - Vb >= a: # ? нужно ли?  # После переливания из A остаток поместится в A
        Vb += a
    else:
        Vb = a - (b - Vb)
        print(max, '>', sep='')     
        print(min, '>', max, sep='')
    

        
        
