/*
ip адреса
1) Чтобы найти АДРЕС СЕТИ, выпишите те биты IP АДРЕСА, где у маски 1.
Затем запишите 0 там где у маски 0.
Переведите каждый байт в десятичную СС.

2) Чтобы найти НОМЕР КОМПЬЮТЕРА, выпишите те биты IP АДРЕСА, где у маски 0.
Переведите двоичное число в десятичную СС, игнорируя точки.

3) Количество компьютеров в сети равно 2^N - 2, где N - количество нулей в маске.

4) Количество адресов в сети равно 2^N, где N - количество нулей в маске.

5) broadcast addr = net adr + 2^n-1, где n число нулей в маске.
Прибавляя, учтите, что в 0 байте может быть число только от 0 до 255, а числа 256, 512 и более - биты в 1 байте.
*/


/*
0)  ip                              1100 0000. 1010 1000. 0000 0001. 1111 1110  == 192.168.1.254
    mask                            1111 1111. 1111 1111. 1111 1111. 1000 0000  == 255.255.255.128
    арес сети                       1100 0000. 1010 1000. 0000 0001. 1000 0000  == 192.168.1.128 
    номер компьютера                                                  111 1110  == 126


1)  ip                              1100 0000. 1010 1000. 0000 1010. 1101 1001  == 192.168.10.217
    mask                            1111 1111. 1111 1111. 1111 1111. 1111 0000  == 255.255.255.240
    арес сети                       1100 0000. 1010 1000. 0000 1010. 1101 0000  == 192.168.10.208
    номер компьютера                                                      1001  == 9
    количество компьютеров                                                      == 14
    
    
2)  ip                              1100 0000. 1010 1000. 0000 1010. 1110 0101  == 192.168.10.229
    mask                            1111 1111. 1111 1111. 1111 1111. 1100 0000  == 255.255.255.192
    арес сети                       1100 0000. 1010 1000. 0000 1010. 1100 0000  == 192.168.10.192
    номер компьютера                                                   10 0101  == 37
    количество компьютеров                                                      == 62
        
    
3)  ip                              1100 0000. 1010 1000. 0000 1010. 1100 1001  == 192.168.10.201
    mask                            1111 1111. 1111 1111. 1111 1111. 1000 0000  == 255.255.255.128
    арес сети                       1100 0000. 1010 1000. 0000 1010. 1000 0000  == 192.168.10.128
    номер компьютера                                                  100 1001  == 73
    количество компьютеров                                                      == 126
            
    
4)  ip                              1100 0000. 1010 1000. 0000 1010. 1111 1001  == 192.168.10.249
    mask                            1111 1111. 1111 1111. 1111 1111. 1110 0000  == 255.255.255.224
    арес сети                       1100 0000. 1010 1000. 0000 1010. 1110 0000  == 192.168.10.224
    номер компьютера                                                    1 1001  == 25
    количество компьютеров                                                      == 30
                
    
5)  ip                              1010 1100. 0000 1010. 0000 0000. 1111 1101  == 172.10.0.253
    mask                            1111 1111. 1111 1111. 1111 1111. 1111 1000  == 255.255.255.248
    арес сети                       1010 1100. 0000 1010. 0000 0000. 1111 1000  == 172.10.0.248
    номер компьютера                                                      0101  == 5
    количество компьютеров                                                      == 8
                    
    
6)  ip                              0000 1010. 0000 0000. 0000 0000. 1000 1001  == 10.0.0.137
    mask                            1111 1111. 1111 1111. 1111 1111. 1100 0000  == 255.255.255.192
    арес сети                       0000 1010. 0000 0000. 0000 0000. 1000 0000  == 10.0.0.192
    номер компьютера                                                      1001  == 9
    количество компьютеров                                                      == 62
*/





