/*
9F.js 27.04.2021
Дан список чисел. Определите, сколько в этом списке элементов, которые больше двух своих соседей и выведите количество таких элементов.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1 2 3 4 5
выходные данные
0
*/

// определяет количество локальных максимумов - выводит ответ на задачу
function max(arr) {
    let cnt = 0;
    for (let i = 1; i < arr.length - 1; i++) {
        if (arr[i] > arr[i - 1] && arr[i] > arr[i + 1]) {
            cnt++;
        }
    }
    return cnt;
}

max([1, 2, 1, 4, 1, 6]);