/*
9G.js 27.04.2021
Дан список чисел. Выведите значение наибольшего элемента в списке, а затем индекс этого элемента в списке. Если наибольших элементов несколько, выведите индекс первого из них.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1 2 3 2 1
выходные данные
3 2
*/


// определяет количество локальных максимумов - выводит ответ на задачу
function max(arr) {
    const maxVal = Math.max.apply(null, arr);
    return [maxVal, arr.indexOf(maxVal)];
}

max([1, 2, 3, 2, 1]);