/*
9G.js 04.05.2021
Дан список чисел. Выведите значение наибольшего элемента в списке, а затем индекс этого элемента в списке. Если наибольших элементов несколько, выведите индекс первого из них.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1 2 3 2 1
выходные данные
3 2
*/


// определяет наибольший элемент массива и его индекс - выводит массив ответов
function max(arr) {
  let res = '';
  for (let i = 1; i < arr.length - 1; i++) {
    if (arr[i] > arr[i - 1] && arr[i] > arr[i + 1]) {
      return res + arr[i] + ' ' + i;
    }
  }
  return res;
}

// принимает массив, печатает массив на консоль
function arrayPrint(str) {
  console.log(str);
}

// принимает массив, вводимый пользователем, возвращает массив чисел
function arrayInput() {
  return prompt('Введите числа через пробел').split(' ').map(item => Number(item));
}

function interfaceTest() {
  arrayPrint(max(arrayInput()));    
}

function test() {
  arrayPrint(max([1, 2, 3, 2, 1]));
}

//interfaceTest();
test();

