/*
9H.js 04.05.2021
Выведите значение наименьшего из всех положительных элементов в списке. Известно, что в списке есть хотя бы один положительный элемент, а значения всех элементов списка по модулю не превосходят 1000.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
5 -4 3 -2 1
выходные данные
1
*/


// определяет наименьшее положительное - возвращвет число
function minPos(arr) {
    return Math.min(...arr.filter(item => item > 0));
}

// принимает число, печатает число на консоль
function arrayPrint(num) {
    console.log(String(num));
}

// принимает массив, вводимый пользователем, возвращает массив чисел
function arrayInput() {
    return prompt('Введите числа через пробел').split(' ').map(item => Number(item));
}

function interfaceTest() {
    arrayPrint(minPos(arrayInput()));    
}

function test() {
    arrayPrint(minPos([5, -4, 3, -2, 1]));
    arrayPrint(minPos([5, -4, 3, 0, 1]));
}

//interfaceTest();
test();
