/*
9H.js 28.04.2021
Выведите значение наименьшего из всех положительных элементов в списке. Известно, что в списке есть хотя бы один положительный элемент, а значения всех элементов списка по модулю не превосходят 1000.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
5 -4 3 -2 1
выходные данные
1
*/


// определяет наименьшее положительное - выводит ответ на задачу
function min(arr) {
    return Math.min.apply(null, arr.filter(item => item > 0));
}

min([5, -4, 3, -2, 1]);