/*
9H.js 13.02.2020
Выведите значение наименьшего из всех положительных элементов в списке. 
Известно, что в списке есть хотя бы один положительный элемент, а значения всех элементов списка по модулю не превосходят 1000.
Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
5 -4 3 -2 1
выходные данные
1
*/
var arrNum = '5 -4 3 -2 14'.split(' ').map(Number);
var min = 1001;
// var arr = [5, -4, 3, -2, 4, 3, 1];
for (var i = 0; i < arrNum.length; i++) {
    if (arrNum[i] < min && arrNum[i] > 0)
        min = arrNum[i];
}
console.log(min);