/*
9I.js 28.04.2021
Выведите значение наименьшего нечетного элемента списка, а если в списке нет нечетных элементов - выведите число 0.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
0 1 2 3 4
выходные данные
1
входные данные
2 4 6 8 10
выходные данные
0
*/


// определяет наименьшее положительное - выводит ответ на задачу
function min(arr) {
    arr = arr.filter(item => item % 2 != 0);
    return Math.min.apply(null, arr.length > 0 ? arr : [0]);
}

min([0, 1, 2, -3, 4]);
// min([2, 4, 6, 8, 10]);
