/*
9I.js 13.02.2020
Выведите значение наименьшего нечетного элемента списка, а если в списке нет нечетных элементов - выведите число 0.
Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
0 1 2 3 4
выходные данные
1
входные данные
2 4 6 8 10
выходные данные
0
Эффективно решение без индекса - через значение.
*/

// var arrNum = '2 3 6 7 10'.split(' ').map(Number)
var arrNum = [2, 3, 6, 8, 10, 1];
var iMin = -1; // Чтобы отличать ситуацию НЕ инициализированного значения.
for (var i = 0; i < arrNum.length; i++) {
    if (arrNum[i]%2 != 0 && (iMin < 0 || arrNum[i]<arrNum[iMin]))
        iMin = i;
}
console.log(iMin != -1 ? arrNum[iMin] : 0);