/*
9I.js 13.02.2020
Выведите значение наименьшего нечетного элемента списка, а если в списке нет нечетных элементов - выведите число 0.
Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
0 1 2 3 4
выходные данные
1
входные данные
2 4 6 8 10
выходные данные
0
Straight forward with Flag.
*/

// var arrNum = '2 3 6 7 10'.split(' ').map(Number)
var arrNum = [2, 3, 6, 8, 10, 1];
var mi = 0; // Инициализировать чем угодно, значения не имеет.
var no_elem = true; // Элементов нет.
for (elem of arrNum) {
    if (elem%2 != 0 && (no_elem || elem < mi)) {
        mi = elem;
        no_elem = false;
    }
}
console.log(no_elem ? 0 : mi);