/*
9K.js 13.02.2020
Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.
Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
1 2 2 3 3 3
выходные данные
3
*/
var arrNum = '1 2 2 3 3 3 4 4 4 4 4 5 5 5 5 5 5 5 5'.split(' ').map(Number);
var count = 1;
var elem = arrNum[0];
// var arr = [1, 2, 2, 3, 3, 3, 4, 7, 9, 9, 9, 9];
for (var i = 1; i < arrNum.length; i++) {
    if (arrNum[i] > elem) {
        count++;
    }
    elem = arrNum[i];
}
console.log(count);