/*
9P.js 29.02.2020
В списке все элементы различны. Поменяйте местами минимальный и максимальный элемент этого списка.
Входные данные
Вводится список целых чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
3 4 5 2 1
выходные данные
3 4 1 2 5 

1) В создаем переменную буфер.
2) В цикле находим индексы минимального и максимального элементов.
3) В буфер записываем значения максимального элемента ПОСЛЕ ЦИКЛА.
4) Если i дошел до конца, то есть найдены max и min, то копируем значение min в max, а из буфера(значение max) в min.
*/
var arrNum = '3 4 5 2 1'.split(' ').map(Number);
var imin = 0; // Индекс минимального значения.
var imax = 0; // Индекс максимального значения.
for (var i = 0; i < arrNum.length; i++) {
    if (arrNum[imax] < arrNum[i]) {
        imax = i;
    }
    if (arrNum[imin] > arrNum[i]) {
        imin = i;
    }
}
var temp = arrNum[imax];
arrNum[imax] = arrNum[imin];
arrNum[imin] = temp;
// console.log(imin, imax);
console.log(arrNum.map(String).join(' '));