/*
9Q.js 11.05.2021
Дан список из чисел и индекс элемента в списке k. Удалите из списка элемент с индексом k, сдвинув влево все элементы, стоящие правее элемента с индексом k.

Программа получает на вход список, затем число k. Программа сдвигает все элементы, а после этого удаляет последний элемент списка при помощи метода pop().

Программа должна осуществлять сдвиг непосредственно в списке, а не делать это при выводе элементов. Также нельзя использовать дополнительный список.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке. В следующей строке вводится одно целое число.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
7 6 5 4 3 2 1
2
выходные данные
7 6 4 3 2 1 
*/

// удаляет элемент по индексу - возвращает массив - ответ на задачу
function deleteElem(arr, k) {
    arr.splice(k, 1);
    return arr;
}

// принимает массив, печатает массив на консоль
function arrayPrint(arr) {
    console.log(arr.map(element => String(element)).join(' '));
}

// принимает массив, вводимый пользователем, возвращает массив чисел
function arrayInput() {
    return prompt('Введите числа через пробел').split(' ').map(item => Number(item));
}

function interfaceTest() {
    arrayPrint(deleteElem(arrayInput()));    
}

function test() {
    arrayPrint(deleteElem([7, 6, 5, 4, 3, 2, 1], 2));
    arrayPrint(deleteElem([1, 2, 3, 4, 5], 3));
    arrayPrint(deleteElem([1, 2, 3, 4, 5, 6], 4));
    arrayPrint(deleteElem([2, 1, 3, 4, 5, 7, 6], 0));
}

//interfaceTest();
test();



