/*
9S.js 11.05.2021
Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1 2 3 2 3
выходные данные
2
входные данные
1 1 1 1 1
выходные данные
10
*/

// сравнивает каждый элемент с остальными - возвращает число - ответ на задачу
function copy(arr) {
    let cnt = 0;
    for (let i = 0; i < arr.length; i++) {
        for (let j = i + 1; j < arr.length; j++) {
            if (arr[i] == arr[j]) {
                cnt++;
            }
        }
    }
    return cnt;
}

// принимает число, печатает число на консоль
function arrayPrint(num) {
    console.log(String(num));
}

// принимает массив, вводимый пользователем, возвращает массив чисел
function arrayInput() {
    return prompt('Введите числа через пробел').split(' ').map(item => Number(item));
}

function interfaceTest() {
    arrayPrint(copy(arrayInput()));    
}

function test() {
    arrayPrint(copy([1, 2, 3, 2, 3])); // 2
    arrayPrint(copy([1, 1, 1, 1, 1])); // 10
    arrayPrint(copy([1, 2, 3, 2, 5, 6])); // 1
    arrayPrint(copy([2, 1, 3, 1, 5, 1, 6])); // 3
}

//interfaceTest();
test();



