/*
9U.js 13.03.2020
Дан список. Посчитайте, сколько в нем различных элементов, не изменяя самого списка.
Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Примеры
входные данные
3 2 1 2 3
выходные данные
3

9U с флагом. 
O(N^2), треугольная, с хорошим аммеортизированным средним t
*/

var arrNum = '3 2 1 2 3'.split(' ').map(Number);
var count = 0;   // счетчик уникальных элемент
var uniq = true; // уникальность a[i]
for (var i = 0; i < arrNum.length; i++) { // i элемент - проверка на уникальность
    uniq = true; // a[i] уникален
    for (var j = i + 1; j < arrNum.length; j++) // Сравнение i со всеми остальными j после него.
        if (arrNum[i] == arrNum[j]) { // a[i] элемент не уникален
            uniq = false;
            break;
        }
    if (uniq)    // a[i] элемент уникален
        count++;
}
console.log(count);