'''Дан список целых чисел. Требуется “сжать” его,
переместив все ненулевые элементы в левую часть списка,
не меняя их порядок, а все нули - в правую часть.
Порядок ненулевых элементов изменять нельзя,
дополнительный список использовать нельзя,
задачу нужно выполнить за один проход по списку.
Распечатайте полученный список.

Входные данные
Вводится список чисел.
Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4 0 5 0 3 0 0 5
выходные данные
4 5 3 5 0 0 0 0

100% mink

Алгоритм SHIFT: присваивание, а не обмен местами.

1) 9W_swap
Алгоритм SWAP (обмен): нулевые и ненулевые значения меняются местами.
spisok[zero], spisok[i] = spisok[i], 0
Нужно, просматривая в цикле слева направо список, запоминать положение нулей, и замещать нули ненулевыми элементами, 
поменям местами крайний левый ноль и очередной ненулевой элемент.
Нельзя использовать во внешнем цикле append, pop и другие линейные методы, включая другие циклы. 
Алгоритм должен иметь линейный порядок роста. 

2) 9W_shift: 
Алгоритм SHIFT: присваивание, а не обмен местами.
spisok[cnt] = spisok[i]
Нужно, просматривая в цикле слева направо список, запоминать положение нулей,
и замещать нули ненулевыми элементами.
Нельзя использовать во внешнем цикле append, pop и другие линейные методы, включая другие циклы. 
Алгоритм должен иметь линейный порядок роста. 
'''

a = list(map(int,input().split()))
cnt = 0  # Количество ненулевых элементов.
for i in range(len(a)): 
    if a[i] > 0:        # a[i] - проверяемый элемент
        a[cnt] = a[i]   # a[cnt] - перезаписываемый элемент
        cnt += 1
for i in range(cnt,len(a)):
    a[i] = 0
print(' '.join(list(map(str,a))))
    
