'''
Дан список целых чисел. Требуется “сжать” его, переместив все ненулевые элементы в левую часть списка, не меняя их порядок, а все нули - в правую часть. Порядок ненулевых элементов изменять нельзя, дополнительный список использовать нельзя, задачу нужно выполнить за один проход по списку. Распечатайте полученный список.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4 0 5 0 3 0 0 5
выходные данные
4 5 3 5 0 0 0 0

Ищется первый нуль в списке и заносится в zero его индекс,
после этого ищет ненулевой элемент и переставляет его значение и значение элемента zero местами
после этого прибавляет к индексу zero единицу,
так как следующий за ним элемент теперь гарантированно крайний левый ноль
после этого ищет следующий ненулевой элемент и т.д.
Алогритм не ищет нулевой элемент(кроме первого) и не записывает в zero его индекс!

Егор 100%
'''

a=[int(i) for i in input().split()]
firstfound=False # становится True, когда найден первый нулевой элемент
zero=0 # индекс первого нуля
for i in range(len(a)):
    if a[i]==0 and not firstfound:
        zero=i
        firstfound=True
    elif a[i]!=0: 
        a[zero],a[i]=a[i],a[zero]
        zero+=1               
print(*a)

