/*
9Y.js 12.05.2021
Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга. Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга.

Входные данные
Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей.

Выходные данные
Если ферзи не бьют друг друга, выведите слово NO, иначе выведите YES.

Примеры
входные данные
1 7
2 4
3 2
4 8
5 6
6 1
7 3
8 5
выходные данные
NO
входные данные
1 8
2 7
3 6
4 5
5 4
6 3
7 2
8 1
выходные данные
YES
*/

// принимает массив кеглей и массивы попыток, возвращает массив - ответ на задачу
function bowling([N, nums]) {
    N = new Array(N).fill('I');
    nums.forEach(item => {
        let len = item[1] - item[0] + 1; // количество кеглей, сбитых за попытку
        N.splice(item[0] - 1, len, ...((new Array(len)).fill('.')));    
    });
    return N;
}

// принимает массив, печатает массив на консоль
function arrayPrint(arr) {
    console.log(arr.map(element => String(element)).join(' '));
}

// принимает длину ряда, количество шаров, массивы с номерами сбитых кегель, вводимые пользователем, возвращает массив данных
function arrayInput() {
    let N = Number(prompt('Введите длину ряда'));
    let K = Number(prompt('Введите количество шаров'));
    let nums = new Array(K);
    for (let i = 0; i < nums.length; i++) {
        nums[i] = [prompt('Номер левой кегли'), prompt('Номер правой кегли')];
    }
    return [N, nums];
}

function interfaceTest() {
    arrayPrint(bowling(arrayInput()));    
}

function test() {
    arrayPrint(bowling([10, [[8, 10], [2, 5], [3, 6]]])); 
}

// interfaceTest();
test();






