'''Известно, что на доске 8×8 можно расставить 8 ферзей так,
чтобы они не били друг друга. Вам дана расстановка 8 ферзей на доске,
определите, есть ли среди них пара бьющих друг друга.

Входные данные
Программа получает на вход восемь пар чисел,
каждое число от 1 до 8 - координаты 8 ферзей.

Выходные данные
Если ферзи не бьют друг друга, выведите слово NO,
иначе выведите YES.

Примеры
входные данные
1 7
2 4
3 2
4 8
5 6
6 1
7 3
8 5
выходные данные
NO
входные данные
1 8
2 7
3 6
4 5
5 4
6 3
7 2
8 1
выходные данные
YES

100% mink
'''

# ОТДЕЛЯЙТЕ ИНТЕРФЕЙС ОТ ДВИЖКА
# Правило разделения: Отделяйте правила (policy) от механизма (mechanism);
# отделяйте интерфейс от движка (engine).

# Возвращает True, если ферзь может пойти с x1, y1 на x2, y2, иначе False.
def isCheck(x1,y1,x2,y2):
    return (y1==y2)!=(x1==x2) or abs(x2-x1)==abs(y2-y1)!=0
        
# Принимает список координат ферзей, возвращает ответ - бьют ли они друг друга.
def CheckAll(array):
    cnt = len(array)
    for i in range(cnt):
        for j in range(i+1,cnt):
            if isCheck(array[i][0],array[i][1],array[j][0],array[j][1]):
                return True
    return False 
            
# a=[ [1, 7],[2,4],[3,2],[4,8],[5,6],[6,1],[7,3],[8,5]] # NO
# a=[ [1, 8],[2,7],[3,6],[4,5],[5,4],[6,3],[7,2],[8,1]] # YES
#print(isCheck(1,1,2,2)) # True
#print(isCheck(1,1,3,4)) # False
a = [list(map(int,input().split())) for i in range(8)]
print('YES' if CheckAll(a) else 'NO')






















