'''
Известно, что на доске 8×8 можно расставить 8 ферзей так,
чтобы они не били друг друга. Вам дана расстановка 8 ферзей на доске,
определите, есть ли среди них пара бьющих друг друга.

Входные данные
Программа получает на вход восемь пар чисел, каждое число от 1 до 8 -
координаты 8 ферзей.

Выходные данные
Если ферзи не бьют друг друга, выведите слово NO, иначе выведите YES.

Примеры
входные данные
1 7
2 4
3 2
4 8
5 6
6 1
7 3
8 5
выходные данные
NO
входные данные
1 8
2 7
3 6
4 5
5 4
6 3
7 2
8 1
выходные данные
YES

# ОТДЕЛЯЙТЕ ИНТЕРФЕЙС ОТ ДВИЖКА
# Правило разделения: Отделяйте правила (policy) от механизма (mechanism);
# отделяйте интерфейс от движка (engine).

TEST 100%
'''

'''
Принимает координаты двух ферзей.
Возвращает True, если они бьют друг друга, иначе False.
'''
def isCheck(x1,y1,x2,y2):
    return (y1==y2)!=(x1==x2) or abs(x2-x1)==abs(y2-y1)!=0

'''
Принимает список из восьми списков,
представляющих собой координаты ферзей (x, y).
Возвращает True, если хотя бы два ферзя бьют друг друга, иначе False.
'''
def checkAll(spisok):
    for i in range(7):
        for j in range(i, 8):
            if isCheck(spisok[i][0], spisok[i][1], spisok[j][0], spisok[j][1]):
                return True
    return False

print('YES' if checkAll([[int(i) for i in input().split()] for j in range(8)]) else 'NO')
















    
