'''Известно, что на доске 8×8 можно расставить 8 ферзей так,
чтобы они не били друг друга. Вам дана расстановка 8 ферзей на доске,
определите,
есть ли среди них пара бьющих друг друга.
Примеры
Входные данные
1 7
2 4
3 2
4 8
5 6
6 1
7 3
8 5
Выходные данные
NO
Входные данные
1 8
2 7
3 6
4 5
5 4
6 3
7 2
8 1
Выходные данные
YES

mink 100%
'''

# Возвращает True, если ферзь 1 может ударить поле 2, иначе False
def isCheck(x1,y1,x2,y2):
    return (abs(x1-x2)==abs(y1-y2)!=0) or (x1==x2)!=(y1==y2) # Как слон или как ладья

''' # Данные для теста: 
x=[1,2,3,4,5,6,7,8]
y=[7,4,2,8,6,1,3,5] # NO
y=[8,7,6,5,4,3,2,1] # YES
'''
x=[0]*8
y=[0]*8
for i in range(8):
    x[i], y[i]=tuple(map(int, input().split()))
res=False # Бьют ли ферзи друг друга
for i in range(8):
    for j in range(i+1,8):
        if isCheck(x[i], y[i], x[j], y[j]): # Да, бьют 
            res=True 
print('YES' if res else 'NO')
