/*
9Z.js 08.04.2020
Дан список из N (1<=N<=100000) целых чисел и число K (|K|<100000 ). 
Циклически сдвиньте список на |K| элементов вправо, если K – положительное и влево, если отрицательное число.
Входные данные
Программа получает на вход список целых чисел, затем число K.
Выходные данные
Решение должно иметь сложность O(N), то есть не должно зависеть от K.
Дополнительным списком пользоваться нельзя.
Примеры
входные данные
5 3 7 4 6
3
выходные данные
7 4 6 5 3

shift() удаляет из массива первый элемент и возвращает его. (сдвиг ВЛЕВО)
unshift() добавляет один или несколько элементов в начало массива и возвращает его новую длинну. (сдвиг ВПРАВО)
*/

var arrNum = prompt().split(' ').map(Number); // prompt().split(' ').map(Number); 
var k = parseInt(prompt()); // 3;  
if (k > 0) for(var i = 0; i < k; i++) { // Вправо, unshift (вправо, если K – положительное)
    arrNum.unshift(arrNum[arrNum.length-1]);
    arrNum.pop();
}
else for(var i = k; i < 0; i++) { // Влево, shift (влево, если отрицательное число)
    arrNum.push(arrNum[0]);
    arrNum.shift();
}
console.log(arrNum.map(String).join(' '));