'''
Дан список из N (1≤N≤100000) целых чисел и число K (|K|<100000).
Циклически сдвиньте список на |K| элементов вправо, если K – положительное и влево, если отрицательное число.

Входные данные
Программа получает на вход список целых чисел, затем число K.

Выходные данные
Решение должно иметь сложность O(N), то есть не должно зависеть от K.

Дополнительным списком пользоваться нельзя.
Примеры
входные данные
5 3 7 4 6
3
выходные данные
7 4 6 5 3

-Нужно получить индекс start (int) исходного списка,
 который является индексом элемента,
с которого начинается сдвинутый список.

-Нужно взять два среза исходного списка и соединить их для получения сдвинутого списка, 
используя переменную start.

100%
'''

import math

a=[int(i) for i in input().split()]
ind=int(input())%len(a)-1 # число членов в части справа, которую нужно передвинуть влево, уменьшенное на 1
a.reverse()
# print(*a)
for i in range(math.ceil(ind/2)):
        a[i],a[ind-i]=a[ind-i],a[i]
# print(*a)
for i in range(1,math.ceil((len(a)-ind)/2)):
        a[ind+i],a[len(a)-i]=a[len(a)-i],a[ind+i]
print(*a)


