/*
3_A-A.js 07.08.2020. 
Дано три числа. Упорядочите их в порядке неубывания. Программа должна считывать три числа a, b, c, затем программа должна менять 
их значения так, чтобы стали выполнены условия a <= b <= c, затем программа выводит тройку a, b, c.
Примечание
Дополнительные ограничения: нельзя использовать дополнительные переменные (то есть единственной допустимой операцией присваивания 
является обмен значений двух переменных типа (a, b) = (b, a).
Программа должна содержать ровно один вызов функции печати результата.

Входные данные
Вводятся три числа.
1
2
1
Выходные данные
Выведите ответ на задачу.
1 1 2
*/

let a = 3;
let b = 1;
let c = 2;
if (a >= b) [a, b] = [b, a];
if (b >= c) [b, c] = [c, b];
if (a >= b) [a, b] = [b, a];
console.log(a, b, c);

