/*
3Djs 21.07.2020. 
Дано натуральное число. Требуется определить, является ли год с данным номером високосным. Если год является високосным, 
то выведите YES, иначе выведите NO. Напомним, что в соответствии с григорианским календарем, год является високосным, 
если его номер кратен 4, но не кратен 100, а также если он кратен 400.

Входные данные
Вводится одно натуральное число.
100 
Выходные данные
Выведите ответ на задачу.
NO

Дополнительный тест
1900 1904 2000 2018
NO   YES  YES  NO
*/

let a = 2020;
if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {
    console.log("YES");
} else {
    console.log("NO");
}