/*
3Djs 21.07.2020. 
Дано натуральное число. Требуется определить, является ли год с данным номером високосным. Если год является високосным, 
то выведите YES, иначе выведите NO. Напомним, что в соответствии с григорианским календарем, год является високосным, 
если его номер кратен 4, но не кратен 100, а также если он кратен 400.

Входные данные
Вводится одно натуральное число.
100
Выходные данные
Выведите ответ на задачу.
NO
*/

let a = 2018;
let b = (a % 4 == 0 && a % 100 != 0 || a % 400 == 0 ? "YES" : "NO");
console.log(b);