/*
Даны три целых числа. Найдите наибольшее из них (программа должна вывести ровно одно целое число).

Используйте ровно два оператора сравнения (>, <, >=, <=) для решения этой задачи. Использовать функции max и min нельзя.

Входные данные
Вводится три целых числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
2
3
выходные данные
3
*/
var numone = parseInt(prompt('Введите число'));
var numtwo = parseInt(prompt('Введите число'));
var numthree = parseInt(prompt('Введите число'));
var max = numone; // АЛГОРИТМ ПОИСКА МАКСИМУМА
if(numtwo>max) max=numtwo;
if(numthree>max) max=numthree;
console.log(max);