/*
3F.js 21.07.2020. 
Даны три натуральных числа a, b, c. Определите, существует ли треугольник с такими сторонами. Если треугольник существует, 
выведите строку YES, иначе выведите строку NO.

Треугольник — это три точки, не лежащие на одной прямой.

Входные данные
Вводятся три натуральных числа.
3
4
5
Выходные данные
Выведите ответ на задачу.
YES
*/

let a = 3;
let b = 4;
let c = 5;
console.log(a + b <= c || a + c <= b || b + c <= a ? "NO" : "YES");
console.log(a + b > c && a + c > b && b + c > a ? "YES" : "NO");

