/*
3H.js 21.07.2020. 
Денис Павлович задал школьникам задачу: “Если данное четырехзначное число является симметричным, выведите 1, 
иначе выведите любое другое целое число”. Для проверки Денис Павлович использует заранее подготовленный набор тестов и правильных ответов к ним.

Ире кажется, что она решила эту задачу, но тестирующая система Ejudge почему-то не принимает ее решение. 
Ира думает, что это происходит оттого, что она выводит не то любое другое число, которое записано в ответах у Дениса Павловича.

Напишите программу, которая по ответу Дениса Павловича и по ответу Иры определяет, верно ли Ира решила задачу.

Входные данные
Программа получает на вход два числа: ответ Дениса Павловича и ответ Иры.
11      3
-1      1
Выходные данные
Выведите ответ на задачу.
YES     NO
*/

let a = 36;
let b = 24;
console.log(a == 1 && b ==1 || a !== 1 && b !== 1 ? "YES" : "NO");