/*
3I.js 22.07.2020. 
Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, 
может ли ладья попасть с первой клетки на вторую одним ходом.

Входные данные
Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
4
4
5
5
Выходные данные
Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в противном случае.
YES
*/

let x1 = 4;
let y1 = 4;
let x2 = 5;
let y2 = 4;
// (x не изменился ИЛИ y не изменился) И ладья пошла
console.log((x1 == x2 || y1 == y2) && (x1 != x2 || y1 != y2 ) ? "YES" : "NO");