/*
3I.js 22.07.2020. 
Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, 
может ли ладья попасть с первой клетки на вторую одним ходом.

Входные данные
Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
4
4
5
5
Выходные данные
Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в противном случае.
YES
*/

let a = 4;
let b = 4;
let c = 5;
let d = 4;
console.log(a == c || b == d ? "YES" : "NO");