/*
3J.js 26.07.2020. 
Шахматный король ходит по горизонтали, вертикали и диагонали, но только на 1 клетку. 
Даны две различные клетки шахматной доски, определите, может ли король попасть с первой клетки на вторую одним ходом.

Входные данные
Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
4
4
5
5
Выходные данные
Программа должна вывести YES, если из первой клетки ходом короля можно попасть во вторую или NO в противном случае.
YES
*/

let x1 = 4;
let y1 = 4;
let x2 = 3;
let y2 = 1;
let s2 = Math.pow(x2 - x1, 2) + Math.pow(y2 - y1, 2); // квадрат длины хода короля
// король ходит: на 1 ИЛИ sqrt(2)
console.log(s2 == 1 || s2 == 2 ? "YES" : "NO");