/*
3L.js 26.07.2020. 
Шахматный ферзь ходит по диагонали, горизонтали или вертикали. 
Даны две различные клетки шахматной доски, определите, может ли ферзь попасть с первой клетки на вторую одним ходом.

Входные данные
Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
1           1
1           1
2           2
2           3
Выходные данные
Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую или NO в противном случае.
YES         NO
*/

let x1 = 1;
let y1 = 2;
let x2 = 5;
let y2 = 1;
let dx = Math.abs(x2 - x1);
let dy = Math.abs(y2 - y1);
// let s = Math.sqrt(dx * dy);
/*console.log(c < a && (d == b + (a - c) || d == b - (a - c) || d == b) || c >= a && (d == b - (a - c) || d == b + (a - c) || d == b) ? "YES" : "NO"); 
                = A && (C || D || E) || B && (C || D || E) = (A || B) && (C || D || E) */
console.log(dx != 0 && dx == dy || (dx == 0) != (dy == 0) ? "YES" : "NO");