/*
3M.js 26.07.2020. 
Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении и на одну клетку по горизонтали, или наоборот. 
Даны две различные клетки шахматной доски, определите, может ли конь попасть с первой клетки на вторую одним ходом.

Входные данные
Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
1           2
1           4
1           3
4           2 
Выходные данные
Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую или NO в противном случае.
NO         YES
*/

let x1 = 2;
let y1 = 4;
let x2 = 3;
let y2 = 2;
let dx = Math.pow(x2 - x1, 2);
let dy = Math.pow(y2 - y1, 2);
let r2 = dx + dy;
console.log(r2 == 5 ? "YES" : "NO");