/*
Заданы две клетки шахматной доски. Если они покрашены в один цвет, то выведите слово YES, а если в разные цвета – то NO.

Входные данные
Вводятся 4 числа - координаты клеток.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
1
2
2
выходные данные
YES
входные данные
1
1
2
3
выходные данные
NO
*/
var x1 = parseInt(prompt('Введите число от 1 до 8'));
var y1 = parseInt(prompt('Введите число от 1 до 8'));
var x2 = parseInt(prompt('Введите число от 1 до 8'));
var y2 = parseInt(prompt('Введите число от 1 до 8'));
var dx = x2 - x1;
var dy = y2 - y1;
console.log((dx + dy) % 2 == 0 ? "YES":"NO");