'''
Заданы две клетки шахматной доски.
Если они покрашены в один цвет, то выведите слово YES,
а если в разные цвета – то NO.

Входные данные
Вводятся 4 числа - координаты клеток.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
1
2
2
выходные данные
YES
входные данные
1
1
2
3
выходные данные
NO
'''

x1 = int(input('Столбец 1: '))
y1 = int(input('Строка 1: '))
x2 = int(input('Столбец 2: '))
y2 = int(input('Строка 2: '))
difference = (x2 + y2) - (x1 + y1)
print('YES' if difference % 2 == 0 else 'NO')
