'''
Заданы две клетки шахматной доски. Если они покрашены в один цвет,
то выведите слово YES, а если в разные цвета – то NO.

Входные данные
Вводятся 4 числа - координаты клеток.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
1
2
2
выходные данные
YES
входные данные
1
1
2
3
выходные данные
NO
'''

x1=int(input())
y1=int(input())
x2=int(input())
y2=int(input())
print('YES' if (x1%2==y1%2)==(x2%2==y2%2) else 'NO')
