/*
3P.js 20.04.2019
Даны числа a и b. Решите в целых числах уравнение ax+b=0. 
Выведите все решения этого уравнения, если их число конечно, выведите слово NO, 
если решений нет, выведите слово INF, если решений бесконечно много.

Входные данные
Вводятся два числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
-7
выходные данные
7
входные данные
6
-2
выходные данные
NO
*/
var a = 6;
var b = -2;
x = -b/a;
if ((a == 0) && (b == 0))
    console.log('INF');
else if ((a == 0) || (b%a!=0))
    console.log('NO');
else 
    console.log(-b/a);
