/*
3O.js 03.08.2020. 
Даны числа a и b. Решите в целых числах уравнение ax+b=0. Выведите все решения этого уравнения, если их число конечно, 
выведите слово NO, если решений нет, выведите слово INF, если решений бесконечно много.

Входные данные
Вводятся два числа.
-1        6
 7       -2
Выходные данные
Выведите ответ на задачу.
7         NO
1) Если a==0, есть два случая: 
    1.1   1 = 0 - нет решений
    1.2 0 = 0 - бесконечно решений
    ax + b = 0, при a ==0 это b = 0
2)  Если a != 0, то x=-b/a, есть два случая:
    x целый - 1 решение
    x нецелый - нет решений в целых числах.
*/

let a = 0;
let b = -9;
if (a == 0)   // решение не зависит от x, если а == 0
    console.log(b == 0 ? "INF" : "NO");
else          // решение есть, и оно единственное, если a != 0
    console.log(b % a == 0 ? -b / a : "NO");  // есть целочисленное решение // нет целочисленных решений
