/*
3Q.js 03.08.2020. 
Для данного числа n<100 закончите фразу “На лугу пасется...” одним из возможных продолжений: “n коров”, “n корова”, “n коровы”, 
правильно склоняя слово “корова”.
Входные данные
Вводится натуральное число.
1               2               5
Выходные данные
Программа должна вывести введенное число n и одно из слов: korov, korova или korovy. 
Между числом и словом должен стоять ровно один пробел.
1 korova        2 korovy        korov
*/

let n = 11;
const e = n % 10;
const d = Math.trunc(n / 10);
console.log(e == 1 && d != 1 ? n + " korova" : e < 5 && e != 0 && d != 1 ? n + " korovy" : n + " korov");

 