'''
Для данного числа n<100 закончите фразу “На лугу пасется...”
одним из возможных продолжений: “n коров”, “n корова”, “n коровы”,
правильно склоняя слово “корова”.

Входные данные
Вводится натуральное число.

Выходные данные
Программа должна вывести введенное число n и одно из слов: korov,
korova или korovy. Между числом и словом должен стоять ровно один пробел.

Примеры
входные данные
1
выходные данные
1 korova
входные данные
2
выходные данные
2 korovy
входные данные
5
выходные данные
5 korov
if n // 10 == 1:
    print(n, 'коров')
elif n % 10 == 1:
    print(n, 'корова')
elif n % 10 == 5:
    print(n, 'коров')
elif n % 10 == 6:
    print(n, 'коров')
elif n % 10 == 7:
    print(n, 'коров')
elif n % 10 == 8:
    print(n, 'коров')
elif n % 10 == 9:
    print(n, 'коров')
else:
    print(n, 'коровы')
if n % 10 == 5 or n % 10 == 6 or n % 10 == 7 or n % 10 == 8 or n % 10 == 9 or n // 10 == 1:
'''

n = int(input('Введите число коров: '))
last_digit = n % 10
if 4 < last_digit or last_digit == 0 or n // 10 == 1:
    print(n, 'коров')
elif last_digit == 1:
    print(n, 'корова')
else:
    print(n, 'коровы')
