/*
3R.js 03.08.2020. 
Яша плавал в бассейне размером NxM метров и устал. В этот момент он обнаружил, 
что находится на расстоянии x метров от одного из длинных бортиков (не обязательно от ближайшего) и y метров от одного из коротких бортиков. 
Какое минимальное расстояние должен проплыть Яша, чтобы выбраться из бассейна на бортик?

Входные данные
Программа получает на вход числа N, M, x, y.
23
52
8
43 
Выходные данные
Программа должна вывести число метров, которое нужно проплыть Яше до бортика.
8
*/

let N = 52;
let M = 23;
let x = 20;
let y = 50;
if (M > N) {        // M - длинный бортик, значит х плывём вдоль длины N
    if (x >= N - x) x = N - x;
    if (x >= M - y) x = M - y;
    if (x >= y) x = y;
} else {            // N - длинный бортик, значит х плывём вдоль длины M
    if (x >= M - x) x = M - x;
    if (x >= N - y) x = N - y;
    if (x >= y) x = y;
}   
console.log(x);



 