/*
3R.js 20.04.2019
Яша плавал в бассейне размером N*M метров и устал. 
В этот момент он обнаружил, что находится на расстоянии 'x' метров от одного из длинных бортиков 
(не обязательно от ближайшего) и 'y' метров от одного из коротких бортиков. 
Какое минимальное расстояние должен проплыть Яша, чтобы выбраться из бассейна на бортик?

Входные данные
Программа получает на вход числа N, M, x, y.

Выходные данные
Программа должна вывести число метров, которое нужно проплыть Яше до бортика.

Примеры
входные данные
23
52
8
43
выходные данные
8
*/
var N = 23;
var M = 52;
var x = 8;
var y = 43;
var minDistance;
/*
if (x < (M - y) && x < (N - x) && x < y)
    console.log(x);
else if (y < (N-x) && y < (M-y) && y < x)
    console.log(y);
else if ((M-y) < y && (M-y) < x && (M-y) < (N-x))
    console.log(M-y);
else
    console.log(N-x);
*/

if (x > N/2)
    x = N-x;
if (y > M/2)
    y = M - y;
if (x > y)
    minDistance = y;
else
    minDistance = x;
console.log(minDistance);