'''
Яша плавал в бассейне размером N*M метров и устал. В этот момент
он обнаружил, что находится на расстоянии x метров от одного из длинных
бортиков (не обязательно от ближайшего) и y метров от одного из коротких
бортиков. Какое минимальное расстояние должен проплыть Яша, чтобы выбраться из
бассейна на бортик?

Входные данные
Программа получает на вход числа N, M, x, y.

Выходные данные
Программа должна вывести число метров, которое нужно проплыть Яше до бортика.

Примеры
входные данные
23
52
8
43
выходные данные
8
Запишем в М значение максимальной стороны
Запишем в N значение минимальной стороны
решить правильно. К длинному бортику Яша плывет вдоль короткого бортика!
100%
'''
N=int(input())
M=int(input())
x=int(input())
y=int(input())
if N>M :
    M,N=N,M
print(min(x,y,N-x,M-y))
