/*
3S.js 03.08.2020. 
Давным-давно билет на одну поездку в метро стоил 15 рублей, билет на 10 поездок стоил 125 рублей, билет на 60 поездок стоил 440 рублей. 
Пассажир планирует совершить n поездок. Определите, сколько билетов каждого вида он должен приобрести, чтобы суммарное количество 
оплаченных поездок было не меньше n, а общая стоимость приобретенных билетов — минимальна.

Входные данные
Программа получает на вход одно число n.
36              64
Выходные данные
Программа должна вывести три целых числа, равных необходимому количеству билетов на 1, на 10, на 60 поездок.
0 0 1           4 0 1
*/

let n = 64;
let total_60 = Math.trunc(n / 60); //console.log(total_60);
let total_10 = Math.trunc(n % 60 / 10); //console.log(total_10);
let total_1 = n % 10; //console.log(total_1);
if (total_1 * 15 > 125) {
    total_1 = 0;
    total_10++;
}
if (total_10 * 125 + total_1 * 15 > 440) {
    total_10 = 0;
    total_1 = 0;
    total_60++;
}
console.log(total_1, total_10, total_60); 