/*
3U.js 03.08.2020. 
Давным-давно цены а билеты были такими:
1 поездка — 15 рублей,
5 поездок — 70 рублей,
10 поездок — 125 рублей,
20 поездок — 230 рублей,
60 поездок — 440 рублей.
Пассажир планирует совершить n поездок. Определите, сколько билетов каждого вида он должен приобрести, 
чтобы суммарное количество оплаченных поездок было не меньше n, а общая стоимость приобретенных билетов — минимальна.
Входные данные
Программа получает на вход одно число n.
1              7
Выходные данные
Программа должна вывести пять целых чисел: количество билетов на 1, 5, 10, 20, 60 поездок, которое необходимо приобрести. 
Если для какого-то данного n существует несколько способов приобретения билетов одинаковой суммарной стоимости, необходимо 
вывести ту комбинацию билетов, которая дает большее число поездок.
1 0 0 0        2 1 0 0 0
*/

let n = 36;
let total_60 = Math.trunc(n / 60); console.log(total_60);
let total_20 = Math.trunc(n % 60 / 20); console.log(total_20);
let total_10 = Math.trunc(n % 20 / 10); console.log(total_10);
let total_5 = Math.trunc(n % 10 / 5); console.log(total_5);
let total_1 = n % 5; console.log(total_1);
if (total_1 * 15 > 70) {
    total_1 = 0;
    total_5++;
}
if (total_5 * 70 + total_1 * 15 > 125) {
    total_1 = 0;    
    total_5 = 0;
    total_10++;
}
if (total_10 * 125 + total_5 * 70 + total_1 * 15 > 230) {
    total_10 = 0;
    total_5 = 0;
    total_1 = 0;
    total_20++;
}
if (total_20 * 230 + total_10 * 125 + total_5 * 70 + total_1 > 440) {
    total_20 = 0;
    total_10 = 0;
    total_5 = 0;
    total_1 = 0;
    total_60++;
}
console.log(total_1, total_5, total_10, total_20, total_60); 