'''
Давным-давно цены а билеты были такими:
1 поездка — 15 рублей,
5 поездок — 70 рублей,
10 поездок — 125 рублей,
20 поездок — 230 рублей,
60 поездок — 440 рублей.
Пассажир планирует совершить n поездок. Определите, сколько билетов каждого
вида он должен приобрести, чтобы суммарное количество оплаченных поездок было
не меньше n, а общая стоимость приобретенных билетов — минимальна.
Входные данные
Программа получает на вход одно число n.

Выходные данные
Программа должна вывести пять целых чисел: количество билетов
на 1, 5, 10, 20, 60 поездок, которое необходимо приобрести. Если для какого-то
данного n существует несколько способов приобретения билетов одинаковой
суммарной стоимости, необходимо вывести ту комбинацию билетов, которая дает
большее число поездок.
Примеры
входные данные
1
выходные данные
1 0 0 0 0 
входные данные
7
выходные данные
2 1 0 0 0

100/100 тестов
'''
n=int(input())
n60=n//60
if n%60>=36:
    n60+=1
n=n%60
if 18<=n<36:
    n20=1
else:
    n20=0
if 8<n%20<=17 and n<36:
    n10=1
else:
    n10=0
if 9!=n%20<=17 and n<36:
    n5=(n%10)//5
else:
    n5=0
if n%20<=17 and n%10<9 and n<36:
    n1=n%10-5
    if n%10<=4:
        n1=n%10
else:
    n1=0
print(n1, n5, n10, n20, n60)
