/*
3V.js 03.08.2020. 
За многие годы заточения узник замка Иф проделал в стене прямоугольное отверстие размером D×E. 
Замок Иф сложен из кирпичей, размером A×B×C. Определите, сможет ли узник выбрасывать кирпичи в море через это отверстие, 
если стороны кирпича должны быть параллельны сторонам отверстия.

Входные данные
Программа получает на вход числа A, B, C, D, E.
1       2
1       2
1       2
1       1
1       1
Выходные данные
Программа должна вывести слово YES или NO.
YES     NO
*/

let D = 130; // ширина отверстия
let E = 70; // высота отверстия
let A = 250; // длина кирпича
let B = 125; // ширина кирпича
let C = 65; // высота кирпича
console.log(D >= A && (E >= B || E >= C) || D >= B && (E >= A || E >= C) || D >= C && (E >= A || E >= B) ? "YES" : "NO");
console.log(D - A >= 0 && (E - B >= 0 || E - C >= 0) || D - B >= 0 && (E - A >= 0 || E - C >= 0) || D - C >= 0 && (E - A >= 0 || E - B >= 0) ? "YES" : "NO");
// D - A == A
// E - B == B
// E - C == C
// D - B == D
// E - A == E
// D - C == F
// A*(B + C) + D*(E + C) + F*(E + B)