/*
3V.js 03.08.2020. 
За многие годы заточения узник замка Иф проделал в стене прямоугольное отверстие размером D×E. 
Замок Иф сложен из кирпичей, размером A×B×C. Определите, сможет ли узник выбрасывать кирпичи в море через это отверстие, 
если стороны кирпича должны быть параллельны сторонам отверстия.

Входные данные
Программа получает на вход числа A, B, C, D, E.
1       2
1       2
1       2
1       1
1       1
Выходные данные
Программа должна вывести слово YES или NO.
YES     NO
*/

let D = 130; // ширина отверстия
let E = 70; // высота отверстия
let A = 125; // длина кирпича
let B = 250; // ширина кирпича
let C = 65; // высота кирпича
console.log(D >= A && (E >= B || E >= C) || D >= B && (E >= A || E >= C) || D >= C && (E >= A || E >= B) ? "YES" : "NO");
console.log(D - A >= 0 && (E - B >= 0 || E - C >= 0) || D - B >= 0 && (E - A >= 0 || E - C >= 0) || D - C >= 0 && (E - A >= 0 || E - B >= 0) ? "YES" : "NO");

let hole = [ {D: 130}, {E: 70} ];
let brick = [ {size: 125}, {size: 250}, {size: 65} ];

function compareSize(sizeA, sizeB) {
    return sizeB.size - sizeA.size; 
}

brick.sort(compareSize);
console.log(brick);






