/*
3V.js 03.08.2020. 
За многие годы заточения узник замка Иф проделал в стене прямоугольное отверстие размером D×E. 
Замок Иф сложен из кирпичей, размером A×B×C. Определите, сможет ли узник выбрасывать кирпичи в море через это отверстие, 
если стороны кирпича должны быть параллельны сторонам отверстия.

Входные данные
Программа получает на вход числа A, B, C, D, E.
1       2
1       2
1       2
1       1
1       1
Выходные данные
Программа должна вывести слово YES или NO.
YES     NO
*/

let D = 1300; // ширина отверстия
let E = 20; // высота отверстия
let A = 125; // длина кирпича
let B = 65; // ширина кирпича
let C = 250; // высота кирпича
if (E > D) [D, E] = [E, D]; // теперь D - максимальная, а E - минимальная сторона отверстия
if (A >= B) [A, B] = [B, A];
if (B >= C) [B, C] = [C, B];
if (A >= B) [A, B] = [B, A]; // теперь С - максимальная сторона, а  A и B - минимальные
console.log(E >= A && D >= B ? "YES" : "NO"); // сравниваем с отверстием минимальные стороны кирпича