/*
4H.js 12.08.2020. 
Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n пингвинов. 
Изображение одного пингвина имеет размер 5×9 символов, между двумя соседними пингвинами также имеется пустой (из пробелов) столбец. 
Разрешается вывести пустой столбец после последнего пингвина. Для упрощения рисования скопируйте пингвина из примера в среду разработки.

Входные данные
Вводится натуральное число.
3
Выходные данные
Выведите ответ на задачу.
   _~_       _~_       _~_    
  (o o)     (o o)     (o o)   
 /  V  \   /  V  \   /  V  \  
/(  _  )\ /(  _  )\ /(  _  )\ 
  ^^ ^^     ^^ ^^     ^^ ^^           
*/

let n = 5;
let hair = "";
let eyes = "";
let beak = "";
let wings = "";
let legs = ""; 

for (let i = 1; i <= n; i++) {
     hair += "   _~_     ";
     eyes += "  (o o)    ";
     beak += " /  V  \\   ";
    wings += "/(  __  )\\ ";
    legs += "  ^^  ^^   ";
}

console.log(hair);
console.log(eyes);
console.log(beak);
console.log(wings);
console.log(legs);
