/*
Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n пингвинов. 
Изображение одного пингвина имеет размер 5×9 символов, 
между двумя соседними пингвинами также имеется пустой (из пробелов) столбец. 
Разрешается вывести пустой столбец после последнего пингвина. 
Для упрощения рисования скопируйте пингвина из примера в среду разработки.
Входные данные
Вводится натуральное число.
Выходные данные
Выведите ответ на задачу.
Примечание
Учтите, что вывод данных на экран производится построчно, а не попингвинно.
В некоторых языках программирования символ обратного слэша “\” в текстовых строках имеет специальное значение. 
Чтобы включить в состав текстовой строки такой символ, его нужно повторить дважды. 
Например, для вывода на экран одного такого символа можно использовать такой код: print("\\").
Примеры
Входные данные
3
Выходные данные
   _~_       _~_       _~_    
  (o o)     (o o)     (o o)   
 /  V  \   /  V  \   /  V  \  
/(  _  )\ /(  _  )\ /(  _  )\ 
  ^^ ^^     ^^ ^^     ^^ ^^   

Входные данные
1
Выходные данные
   _~_    
  (o o)   
 /  V  \  
/(  _  )\ 
  ^^ ^^   
*/

let n = 3;
let pingvin = ["               __","              / _)","     _/\\/\\/\\_/ /","   _|         /"," _|  (  | (  |","/__.-'|_|--|_|","________________"];
for (let i = 0; i < pingvin.length; i++)
    console.log(pingvin[i].repeat(n));

