/*
4I.js 12.08.2020. 
Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n флагов. 
Изображение одного флага имеет размер 4×4 символов, между двумя соседними флагами также имеется пустой (из пробелов) столбец. 
Разрешается вывести пустой столбец после последнего флага. Внутри каждого флага должен быть записан его номер — число от 1 до n.

Входные данные
Вводится натуральное число.
3                        1     
Выходные данные
Выведите ответ на задачу.
+___ +___ +___          +___       
|1 / |2 / |3 /          |1 /
|__\ |__\ |__\          |__\
|    |    |             |       
*/

let n = 3;
function flag(flags, num) {
     let flag = ["+___ ", "|" + num + "  / ", "|__\\ ", "|    "];
     for (let i = 0; i < flag.length; i++) {
         console.log(flag[i].repeat(flags));
     }
} 
let a = 0;
for (let k = 1; k <= n; k++) {
    a++;
    flag(n, a);
}
// for (let i = 0; i < flag.length; i++) {
//    function num(k) {
//     for (let j = 1; j <= k; j++) {
//     } 
//     return j;
//    } 
//     console.log(flag[i].repeat(n));
// }

