/*
Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n флагов. Изображение одного флага имеет размер 4×4 символов, между двумя соседними флагами также имеется пустой (из пробелов) столбец. Разрешается вывести пустой столбец после последнего флага. Внутри каждого флага должен быть записан его номер — число от 1 до n. 
Входные данные 
Вводится натуральное число.
Выходные данные 
Выведите ответ на задачу.
Примеры
Входные данные
3
Выходные данные
+___ +___ +___ 
|1 / |2 / |3 / 
|__\ |__\ |__\ 
|    |    |    
Входные данные
1
Выходные данные
+___ 
|1 / 
|__\ 
|

v.2 Порядок роста O(N) - быстрее предыдущего
*/

var num = 3;
var flag = ['+___ ', '', '|__\\ ', '|    '];
for(var i=0; i< flag.length; ++i) {  // i - номер строчки
  var st="";
  if(flag[i].length==0)  
    for(var j=0; j< num_ping; ++j)   // j - номер флага
        st += '|' + String(j) + ' / ';
  else 
    for(var j=0; j< num_ping; ++j) 
        st += flag[i];  
  console.log(st);
}