/*
4I.js 12.08.2020. 
Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n флагов. 
Изображение одного флага имеет размер 4×4 символов, между двумя соседними флагами также имеется пустой (из пробелов) столбец. 
Разрешается вывести пустой столбец после последнего флага. Внутри каждого флага должен быть записан его номер — число от 1 до n.

Входные данные
Вводится натуральное число.
3                        1     
Выходные данные
Выведите ответ на задачу.
+___ +___ +___          +___       
|1 / |2 / |3 /          |1 /
|__\ |__\ |__\          |__\
|    |    |             |       
*/

let n = 3;
let flag = ["+___ ", "", "|__\\ ", "|    "];
for (let elem of flag)
    if (elem.length > 0) // строчка без номера флага
        console.log(elem.repeat(n));
    else  {              // строчка с номером флага
        let str = "";
        for (let i = 1; i <= n; i++)   // цикл по флагам, i - номер флага
            str += "|" + i + " / ";
        console.log(str);
    }
