/*
4L.js 13.08.2020. 
Дано 10 целых чисел. Вычислите их сумму. Напишите программу, использующую наименьшее число переменных.

Входные данные
Вводятся 10 целых чисел. Каждое число вводится в отдельной строке.
0
1
2
3
4
5
6
7
8
9    
Выходные данные
Выведите ответ на задачу.
45
*/

let nums = {
    null: 0,
    one: 1,
    two: 2,
    three: 3,
    four: 4,
    five: 5,
    six: 6,
    seven: 7,
    eight: 8,
    nine: 9
};
let sum = 0;
for (let key in nums) {
    sum += nums[key];
}
console.log(sum);