/*
4M.js 13.08.2020. 
Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, затем вводится ровно N целых чисел. 
Какое наименьшее число переменных нужно для решения этой задачи?

Входные данные
В первой строке вводится натуральное число N - количество чисел. В следующих N строках вводится по одному целому числу.
2
235
56
Выходные данные
Выведите ответ на задачу.
291
*/

let num = Number(prompt("Сколько чисел"));
let sum = 0;
for (let i = 1; i <= num; i++) {
   sum += Number(prompt("Введите число"));
}
console.log(sum);

