/*
4O.js 13.08.2020. 
Даны числа a, b, c, d. Выведите в порядке возрастания все целые числа от 0 до 1000, которые являются корнями уравнения ax3+bx2+cx+d=0.

Входные данные
Вводятся целые числа a, b, c и d.
-1    1
1     1
-1    1
1     1
Выходные данные
1
Выведите ответ на задачу. Если в указанном промежутке нет корней уравнения, то ничего выводить не нужно.
*/

let arr = [-1, 1, -1, 1];
let sum = 0;       

for (let x = 0; x <= 1000; x++) {
    for (let i = 0; i < arr.length; i++) {
        sum += arr[i] * Math.pow(x, arr.length - 1 - i);
    }
    if (sum == 0)
        console.log(x);
    sum = 0;
}
