/*
4O.js 21.06.2019
Даны числа a, b, c, d. 
Выведите в порядке возрастания все целые числа от 0 до 1000, которые являются корнями уравнения ax^3+bx^2+cx+d=0.

Входные данные
Вводятся целые числа a, b, c и d.

Выходные данные
Выведите ответ на задачу. Если в указанном промежутке нет корней уравнения, то ничего выводить не нужно.

Примеры
входные данные
-1
1
-1
1
выходные данные
1
входные данные
1
1
1
1
выходные данные
*/
var a = -1;
var b = 1;
var c = -1;
var d = 1;
for (var i = 0; i < 1001; i++)
    if (a*i**3+b*i**2+c*i+d == 0)
        console.log(i);
