/*
4U.js 19.09.2020. 
Даны два четырёхзначных числа A и B. Выведите все четырёхзначные числа на отрезке от A до B, запись которых является палиндромом.
Входные данные
Вводятся два целых числа A и B
1600
2100
Выходные данные
Выведите ответ на задачу.
1661
1771
1881
1991
2002
*/
// проверить числа 16, 17, 18, 19, 20, 21 и отзеркаленные

let A = 1600;
let B = 2100;

for (let i = A; i <= B; i++) {
    if ((Math.trunc(i / 1000) == (i % 10)) && Math.trunc(i / 100) % 10 == Math.trunc(i % 100 / 10)) 
        console.log(i);
}