/*
4U.js 29.06.2019
Даны два четырёхзначных числа A и B. Выведите все четырёхзначные числа на отрезке от A до B, 
запись которых является палиндромом.

Входные данные
Вводятся два целых числа A и B

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1600
2100
выходные данные
1661
1771
1881
1991
2002

О(b - a) - линейный порядок роста.
*/
var a = 1170;
var b = 2112;
var beg = Math.trunc(a%1000/100) >= Math.trunc(a%100/10) ? Math.trunc(a/100) : Math.trunc(a/100)+1; // Первое число, которое нужно проверять
var end = Math.trunc(b%1000/100) >= Math.trunc(b%100/10) ? Math.trunc(b/100)-1 : Math.trunc(b/100); // Последнее число, которое нужно проверять
for (var i = beg; i <= end; i++)
    console.log(i*100 + i%10*10 + Math.trunc(i/10));