/*
4U_fast.js 19.09.2020. 
Даны два четырёхзначных числа A и B. Выведите все четырёхзначные числа на отрезке от A до B, запись которых является палиндромом.
Входные данные
Вводятся два целых числа A и B
1600    
2100
Выходные данные
Выведите ответ на задачу.
1661
1771
1881
1991
2002

1)
1660
2003
выходные данные
1661
1771
1881
1991
2002

2)
1661
2002
выходные данные
1661
1771
1881
1991
2002

3)
1662
2001
выходные данные
1771
1881
1991
*/

function processing(A, B) {
    let A1 = Math.trunc(A / 1000);
    let A2 = Math.trunc(A % 1000 / 100);
    let A3 = Math.trunc(A % 100 / 10);
    let A4 = A % 10;
    let B1 = Math.trunc(B / 1000);
    let B2 = Math.trunc(B % 1000 / 100);
    let B3 = Math.trunc(B % 100 / 10);
    let B4 = B % 10;
    
    let begin = (A2 > A3 || A2 == A3 && A1 >= A4 ? 0 : 1) + Math.trunc(A / 100); //8897  9861
    let end = (B2 < B3 || B2 == B3 && B1 <= B4 ? 0 : -1) + Math.trunc(B / 100);
    for (let i = begin; i <= end; i++) {
        console.log(i * 100 + i % 10 * 10 + Math.trunc(i / 10));
    }
}

let A = 4667;
let B = 5004;
processing(A, B);

