/*
Даны два четырёхзначных числа A и B. Выведите все четырёхзначные числа на отрезке от A до B, запись которых является палиндромом.

Входные данные
Вводятся два целых числа A и B

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1600
2100
выходные данные
1661
1771
1881
1991
2002

1660
2003
выходные данные
1661
1771
1881
1991
2002

1661
2002
выходные данные
1661
1771
1881
1991
2002

1662
2001
выходные данные
1771
1881
1991
*/

let A = 1661;//parseInt(prompt('Введите число'));
let B = 2002;//parseInt(prompt('Введите число'));
let begin = Math.trunc(A/100);
let end = Math.trunc(B/100);
if(begin*100+begin%10*10+Math.trunc(begin/10)<A) begin++; // 16 если палиндром 16>=A(1661==1661), 17 если меньше(1661<1662)
if(end*100+end%10*10+Math.trunc(end/10)>B) end--; // 20 если палиндром 20<=B(2002<2003), 19 если больше(2002>2001)
for(let i = begin; i<= end; i++) {
    console.log(i*100+i%10*10+Math.trunc(i/10));
}