'''
Даны два четырёхзначных числа A и B. Выведите в порядке возрастания все
четырёхзначные числа в интервале от A до B, запись которых содержит ровно три
одинаковые цифры.

Входные данные
Вводятся два целых числа A и B.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1900
2100
выходные данные
1911
1999
2000
2022

может A<B, а может быть A>B
100%
'''

A=int(input())
B=int(input())
for i in range(min(A,B), max(A,B)+1):
    n4=i%10
    n3=i%100//10
    n2=i%1000//100
    n1=i//1000
    if n1==n2==n3!=n4 or n1==n2==n4!=n3 or n1==n3==n4!=n2 or n2==n3==n4!=n1:
        print(i)
    
      
   
    
