'''
Даны два четырёхзначных числа A и B. Выведите в порядке возрастания все
четырёхзначные числа в интервале от A до B, запись которых содержит ровно три
одинаковые цифры.

Входные данные
Вводятся два целых числа A и B.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1900
2100
выходные данные
1911
1999
2000
2022
'''

A = int(input())
B = int(input())
a = 0
b = 0
c = 0
d = 0
for i in range(A, B):
    a = i // 1000
    b = i // 100 % 10
    c = i % 100 // 10
    d = i % 10
    if (a == b == c or a == b == d or a == c == d or b == c == d) and not a == b == c == d:
        print(i)
