'''
Даны два четырёхзначных числа A и B. Выведите в порядке возрастания
все четырёхзначные числа в интервале от A до B, запись которых содержит ровно
три одинаковые цифры.

Входные данные
Вводятся два целых числа A и B.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1900
2100
выходные данные
1911
1999
2000
2022

1900: x=1, y=9, z=0, a=0
x=i//1000
y=i%1000//100
z=i%1000%100//10
a=i%1000%100%10
'''

Number1=int(input())
Number2=int(input())
for i in range(Number1,Number2+1): # 4 варианта выполнения условия (x=y=z, x=y=a, x=z=a, y=z=a)
    if i%1000//100==i//1000==i%1000%100//10 or i%1000//100==i//1000==i%1000%100%10 or i%1000%100//10==i//1000==i%1000%100%10 or i%1000%100//10==i%1000//100==i%1000%100%10:
            print(i)

    
