/*
4V.js 19.09.2020. 
Даны два четырёхзначных числа A и B. Выведите в порядке возрастания все четырёхзначные числа в интервале от A до B,
запись которых содержит ровно три одинаковые цифры.
Входные данные
Вводятся два целых числа A и B
1900
2100
Выходные данные
Выведите ответ на задачу.
1911
1999
2000
2022

может A<B, а может быть A>B
*/

let A = 1900, B = 2100;
for (let i = Math.min(A, B); i <= Math.max(A, B); i++) {
    let n4 = i % 10;
    let n3 = Math.trunc(i % 100 / 10);
    let n2 = Math.trunc(i % 1000 / 100);
    let n1 = Math.trunc(i / 1000);
    if (n1==n2 && n2==n3 && n3!=n4 || n1==n2 && n2==n4 && n4!=n3 || n1==n3 && n3==n4 && n4!=n2 || n2==n3 && n3==n4 && n4!=n1) {
        console.log(i);
    }
}
