/*
4W.js 22.09.2020
Даны целые неотрицательные числа a, b, c, d, при этом 0≤c<d. 
Выведите в порядке возрастания все числа от a до b, которые дают остаток c при делении на d.
Входные данные
Вводятся четыре целых числа a, b, c и d.
2
5
0
2
Выходные данные
Выведите ответ на задачу. Если таких чисел в указанном интервале нет, то ничего выводить не нужно.
2 4
Примечание
В этой задаче нельзя использовать инструкцию if.
1 2 3 4 5 6 7 8 9 10 11     3 2
*/

let a = 8,
    b = 30,
    c = 8,
    d = 10;
let prevD = Math.trunc((a - c) / d) * d; // предыдущее число, кратное d
let prevC = prevD + c; // предыдущее число, кратное d с остатком c
let dif = Math.trunc(a / (prevC + 1)); // количество чисел, кратных d + c, на отрезке от 0 до a
let start = prevC + d * dif;
for (let i = start; i <= b; i += d) {
    console.log(i);
}