'''
Даны целые неотрицательные числа a, b, c, d, при этом 0≤c<d. Выведите в порядке
возрастания все числа от a до b, которые дают остаток c при делении на d.

Входные данные
Вводятся четыре целых числа a, b, c и d.

Выходные данные
Выведите ответ на задачу. Если таких чисел в указанном интервале нет, то ничего
выводить не нужно.

Примечание
В этой задаче нельзя использовать инструкцию if.

Примеры
входные данные
2
5
0
2
выходные данные
2 4

См. 2U: 2U_bool, 2U_int.py

19	100%
'''
a=int(input())
b=int(input())
c=int(input())
d=int(input())
for i in range(c+((a+d-c-1)//d)*d, b+1, d):
    print(i, end=' ')

'''
- Все числа i<=b, которые при делении на d дают остаток с, равны с+0*d, с+1*d,
c+2*d и так для всех значений,для которых i<=b
- необходимо найти первое число i>=a, которое при делении на d, дает остаток c
- первое число i>=a равно с+n*d, где n = (a+d-c-1)//d
'''
