'''
Даны целые неотрицательные числа abcd, при этом 0≤cd .
Выведите в порядке возрастания все числа от a до b, которые дают остаток c при делении на d.

Входные данные
Вводятся четыре целых числа abc и d.

Выходные данные
Выведите ответ на задачу. Если таких чисел в
указанном интервале нет, то ничего выводить не нужно.

Примечание
В этой задаче нельзя использовать инструкцию if.

Примеры
входные данные
2
5
0
2
выходные данные
2 4

TEST 100%
'''

a = int(input())
b = int(input())
c = int(input())
d = int(input())
begin = a // d * d + c
for i in range(begin + d * int(begin < a), b + 1, d):
    print(i, end=' ')
