/*
4Y.js 24.09.2020
Дана монотонная последовательность, 
в которой каждое натуральное число k встречается ровно k раз: 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ...
По данному натуральному n выведите первые n членов этой последовательности.
Попробуйте обойтись только одним циклом for.
Входные данные
Вводится натурально число n.
2       5
Выходные данные
Выведите ответ на задачу.
1 2     1 2 2 3 3
*/

let n = 5;
let cnt = 1;

for (let i = 1; i <= n; i++) {
    for (let k = 1; k <= i; k++) {
        if (cnt > n)
            break;
        console.log(i);
        cnt++;
    }
}

