    /*
4Y.js 24.09.2020
Дана монотонная последовательность, 
в которой каждое натуральное число k встречается ровно k раз: 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ...
По данному натуральному n выведите первые n членов этой последовательности.
Попробуйте обойтись только одним циклом for.
Входные данные
Вводится натурально число n.
2       5
Выходные данные
Выведите ответ на задачу.
1 2     1 2 2 3 3

i    1   2   3   4   5   6   7   8   9   10
tri  1   3   6   10  15  21  28  36  45  55   
cnt  1   2   2   3   3   3   4   4   4   4
*/

// Принимает число n (номер числа), возвращает строку с ответом.
function processing(n) {
    let num = 1; // Выводимое число
    let cnt = 0; // Количество раз (сколько выведено)
    var result = "";
    while (n > 0) { // Пока не выведем все
        result += String(num) + " ";
        --n;
        ++cnt;
        if (cnt == num) { // Если счетчик равен числу - переходим к следующему числу.
            ++num;
            cnt = 0; // Начинаем подсчет заново (для следующего числа).
        }
    }
    return result;
}

let n = 6; // =Number(Prompt())
console.log(processing(n));