''' 4Y mink
Дана монотонная последовательность, в которой каждое натуральное число k
встречается ровно k раз: 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ...

По данному натуральному n выведите первые n членов этой последовательности.
Попробуйте обойтись только одним циклом for.

Входные данные
Вводится натурально число n.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
выходные данные
1 2 
входные данные
5
выходные данные
1 2 2 3 3 
'''

# Вывести n членов последовательности
def sequence(n):
    i=1     # Выводимое число (и количество раз).
    j=0     # Какой раз выводится число i.
    while n>0: # Какой раз печатаем число.
        print(i, end=" ")
        j+=1
        n-=1   # считаем сколько чисел вывели пока они не кончатся.
        if j==i:  # если все числа i вывели - переходим к следующему i.
            i+=1
            j=0  # сбрасываем счетчик выведеных сисел i
        
n=int(input("Введите натурально число n: "))
sequence(n)
