/*
4Z.js 28.09.2020
Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась. 
Найдите ее, зная номера оставшихся карточек.
Входные данные
Дано число N, далее N-1 номер оставшихся карточек (различные числа от 1 до N).
5       4
1       3
2       2
3       4
4
Выходные данные
Программа должна вывести номер потерянной карточки.
5       1
*/

let N = 5, cnt = 0;
let cards = [1, 2, 3, 4];

for (let i = 1; i <= N; i++) {
    cnt += i;
    if (i < N)
        cnt -= cards[i - 1];
}
console.log(cnt);
