/*
Дана строка. Разрежьте ее на две равные части (если длина строки — четная, а если длина строки нечетная, то длина первой части должна быть на один символ больше). Переставьте эти две части местами, результат запишите в новую строку и выведите на экран.

При решении этой задачи нельзя пользоваться инструкцией if.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
Hi
выходные данные
iH
входные данные
Hello
выходные данные
loHel
*/

let st = "Hi";//parseInt(prompt('Введите число'));
let bool = st.length%2;
console.log(st.slice(Math.trunc(st.length/2)+bool, st.length) + st.slice(0, Math.trunc(st.length/2)+bool));