/*
6C.js 31.10.2020. 
Дана строка. Разрежьте ее на две равные части (если длина строки — четная, а если длина строки нечетная, 
то длина первой части должна быть на один символ больше). Переставьте эти две части местами, 
результат запишите в новую строку и выведите на экран.

При решении этой задачи нельзя пользоваться инструкцией if.

Входные данные
Вводится строка.
Hi      Hello
Выходные данные
Выведите ответ на задачу.
iH      loHel
*/

function processing(str) {
    let half = Math.ceil(str.length / 2);
    console.log(str.slice(half, str.length) + str.slice(0, half));
}

let str = 'Hello';
processing(str);