/*
6D.js 31.10.2020. 
Дана строка, состоящая ровно из двух слов, разделенных пробелом. Переставьте эти слова местами. 
Результат запишите в строку и выведите получившуюся строку.

При решении этой задачи нельзя пользоваться циклами и инструкцией if.

Входные данные
Вводится строка.
Hello, world!
Выходные данные
Выведите ответ на задачу.
world! Hello,
*/

function processing(str) {
    let half = str.indexOf(' ');
    console.log(str.slice(half, str.length) + ' ' + str.slice(0, half));
}

let str = 'Hello, world!';
processing(str);