/*
6F.js 06.11.2020. 
Дана строка. Найдите в этой строке второе вхождение буквы f, и выведите индекс этого вхождения. 
Если буква f в данной строке встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.

При решении этой задачи нельзя использовать метод count.

Входные данные
Вводится строка.
comfort     coffee
Выходные данные
Выведите ответ на задачу.
-1           3
*/

function processing(str) {
    let first = str.indexOf('f');   // индекс первого вхождения
    let second = str.indexOf('f', first + 1); // иднекс второго вхождения
    return first < 0 ? -2 : second;
}

let str = 'coffee';
console.log(processing(str));