/*
5E.js 08.10.2020
С начала суток прошло H часов, M минут, S секунд (0≤H<12, 0≤M<60, 0≤S<60). 
По данным числам H, M, S определите угол (в градусах), 
на который повернулаcь часовая стрелка с начала суток и выведите его в виде действительного числа.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.
Входные данные
Вводятся три целых неотрицательных числа.
1
2
6
Выходные данные
Выведите ответ на задачу.
31.05
*/

let a = 1, // часы
    b = 2, // минуты
    c = 6; // секунды
let secondsInDay = 12 * 3600; // секунд в сутках по условию задачи
let secondDegree = 360 / secondsInDay; // угол, на который поворачивает стрелка за 1с
let time = a * 3600 + b * 60 + c; // количество секунд, прошедших с начала суток
let result = time * secondDegree; // угол поворота часовой стрелки
console.log(result);