'''
С начала суток прошло H часов, M минут, S секунд (0H12 , 0M60 , 0S60 ).
По данным числам H, M, S определите угол (в градусах), на который повернулаcь
часовая стрелка с начала суток и выведите его в виде действительного числа.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.

Входные данные
Вводятся три целых неотрицательных числа.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
1
2
6
выходные данные
31.05
'''

H = int(input())
M = int(input())
S = int(input())
print(H * 30 + M / 2 + S / 120)
