/*
5G.js 08.10.2020
С начала суток часовая стрелка повернулась на угол в α градусов. 
Определите сколько полных часов, минут и секунд прошло с начала суток, то есть решите задачу, обратную задаче F. 
Запишите ответ в три переменные и выведите их на экран.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.
Входные данные
Вводится неотрицательное действительное число.
31.05
Выходные данные
Выведите ответ на задачу.
1 2 6
Часовая стрелка поворачивается за час на 30град, минутная на 0.5град, сеундная - на 1/120град
*/



function processing(alpha) {
    let hours = Math.trunc(alpha / 30); // количество часов, прошедших с начала суток
    let minutes = Math.trunc(alpha % 30 * 2); // количество минут, прошедших с начала последнего часа
    let seconds = Math.trunc(alpha % 0.5 * 120); // количество секунд, прошедших с начала последней минуты
    return [hours, minutes, seconds];
}

let alpha = 31.05; // угол, на который повернулась часовая стрелка
let [hours, minutes, seconds] = processing(alpha);
console.log(hours, minutes, seconds); // alert('hours' + 'minutes' + 'seconds');