/*
5H.js 09.10.2020
Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада. 
Вклад составляет X рублей Y копеек. Определите размер вклада через год.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.
Входные данные
Программа должна вывести два числа: величину вклада через год в рублях и копейках. Дробная часть копеек отбрасывается.
12
179
0
Выходные данные
Выведите ответ на задачу.
200 48
*/

let P = 12.11; // годовая процентная ставка
let X = 179; // количество рублей во вкладе
let Y = 0; // количество копеек во вкладе

let con = X * 100 + Y; // размер вклада в копейках
let conYear = con + con * P / 100; // размер вклада через год в копейках
console.log(Math.trunc(conYear / 100), Math.trunc(conYear % 100));