/*
Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада. 
Вклад составляет X рублей Y копеек. Определите размер вклада через год.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.

Входные данные
Программа получает на вход целые числа P, X, Y.

Выходные данные
Программа должна вывести два числа: величину вклада через год в рублях и копейках. Дробная часть копеек отбрасывается.

Примеры
входные данные
12
179
0
выходные данные
200 48
*/

let P = 12;//parseInt(prompt('Введите число'));
let X = 179;//parseInt(prompt('Введите число'));
let Y = 0;//parseInt(prompt('Введите число'));
let kopeyki = X*100+Y;
kopeyki+=Math.trunc(kopeyki*P/100);
console.log(Math.trunc(kopeyki/100), kopeyki%100);