/*
5I.js 09.10.2020
Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада через год. 
Вклад составляет X рублей Y копеек. Определите размер вклада через K лет.

Входные данные
Программа получает на вход целые числа P, X, Y, K.
12
179
0
5
Выходные данные
Программа должна вывести два числа: величину вклада через год в рублях и копейках. 
Дробное число копеек по истечение года отбрасывается. Перерасчет суммы вклада (с отбрасыванием дробных частей копеек) происходит ежегодно.
315 43
*/

let P = 12; // годовая процентная ставка
let X = 179; // количество рублей во вкладе
let Y = 0; // количество копеек во вкладе
let K = 5; // количество лет нахождения вклада

let con = X * 100 + Y; // размер вклада в копейках
for (let i = 1; i <= K; i++) { // размер вклада каждый следующий год
    con += Math.trunc(con * P / 100);
}
console.log(Math.trunc(con / 100), con % 100);  