/*
5J.js 11.10.2020
Цена товара обозначена в рублях с точностью до копеек, то есть действительным числом с двумя цифрами после десятичной точки. 
Запишите в две целочисленные переменные стоимость товара в виде целого числа рублей и целого числа копеек и выведите их на экран.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.
Входные данные
Вводится неотрицательное действительное число.
10.35
Выходные данные
Выведите ответ на задачу.
10 35
*/

let price = 12.00;
let rub = Math.trunc(price);
let kop = Math.round(price * 100 % 100);
console.log(rub, kop);