/*
Цена товара обозначена в рублях с точностью до копеек, то есть действительным числом с двумя цифрами после десятичной точки. Запишите в две целочисленные переменные стоимость товара в виде целого числа рублей и целого числа копеек и выведите их на экран.

При решении этой задачи нельзя пользоваться условными инструкциями и циклами.

Входные данные
Вводится неотрицательное действительное число.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
10.35
выходные данные
10 35
*/

let n = 10.35;//parseInt(prompt('Введите число'));
console.log(Math.trunc(n), Math.round(n%1*100));