/*
5K.js 12.10.2020
Даны действительные коэффициенты a, b, c, при этом a≠0. Решите квадратное уравнение ax2+bx+c=0 и выведите все его корни.

Входные данные
Вводятся три действительных числа.
1           
-1
-2
Выходные данные
Если уравнение имеет два корня, выведите два корня в порядке возрастания, 
если один корень — выведите одно число, если нет корней — не выводите ничего.
-1 2

Доп. тесты
2   0   0
0
*/

let a = 2;
let b = 0;
let c = 0;


let D = b * b - 4 * a * c;
let eps = 1E-15;
   
if (D > eps) {
    let x1 = (-b - Math.sqrt(D)) / 2 * a;
    let x2 = (-b + Math.sqrt(D)) / 2 * a;
    console.log(x1<x2? x1 + ' ' + x2 : x2 + ' ' + x1);
} else if (Math.abs(D) < eps) {
    let x = (-b + Math.sqrt(D)) / 2 * a;
    console.log(x);
}

