/*
5K.js 16.10.2020
Даны произвольные действительные коэффициенты a, b, c. Решите уравнение ax2+bx+c=0.

Входные данные
Вводятся три действительных числа.
1                   1          
-1                  2
-2                  1
Выходные данные
Если данное уравнение не имеет корней, выведите число 0. 
Если уравнение имеет один корень, выведите число 1, а затем этот корень. 
Если уравнение имеет два корня, выведите число 2, а затем два корня в порядке возрастания. 
Если уравнение имеет бесконечно много корней, выведите число 3.
2 -1 2              1 -1
*/

let a = 0;
let b = 0;
let c = 3;
let eps = 1E-15;


if (Math.abs(a) >= eps) {       // парабола
    let D = b * b - 4 * a * c;
    if (-D >= eps) {            // ветки не пересекаются с Ох 
        console.log(0);
    } else if (Math.abs(D) < eps) {         // вершина на Ох
        let x = (-b + Math.sqrt(D)) / 2 * a;
        console.log(1, x);
    } else {                    // ветки пересекаются с Ох в 2 местах
        let x1 = (-b - Math.sqrt(D)) / 2 * a;
        let x2 = (-b + Math.sqrt(D)) / 2 * a;
        console.log(2, x1 < x2 ? x1 + ' ' + x2 : x2 + ' ' + x1); 
    } 
} else {        // прямая
    // x = -c/b; bx + c = 0
    if (Math.abs(b) < eps && Math.abs(c) < eps )  // наклон равен 0, смещение относитеьно Ox 0
        console.log(3);
    else if (Math.abs(b) < eps) // наклон равен 0, смещение относитеьно Ox != 0
        console.log(0);
    else 
        console.log(1, -c / b); // не горизонтальная линия
}




