/*
5N.js 17.08.2019
По данному числу n вычислите сумму 1-1/2+1/3-1/4++...+(-1)**(n+1)/n.

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n). 
Попробуйте также обойтись без использования инструкции if.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
3
выходные данные
0.833333
*/

let n = 3; // let n = Number(prompt(n));
let sum = 0;
for (let i = 1; i <= n; i++)
    sum += (i%2*2-1)/i;
console.log(sum);
