/*
5O.js 17.10.2020
Забудьте формулу суммы геометрической прогрессии и вычислите сумму 1+x+x^2+...+x^n.

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n) (то есть должен содержать только один цикл).


Входные данные
Программа получает на вход целое число n и действительное число x.
4
0.1
Выходные данные
Выведите ответ на задачу.
1.1111
*/

let n = 2;
let x = 0.1;
let sum = 1.0; // ряд стартует со значения 1. Цикл будет на 1 шаг короче.
for (let i = 1, item = x; i <= n; i++) {
    sum += item;
    item *= x;
}
console.log(sum);


