/*
Забудьте формулу суммы геометрической прогрессии и вычислите сумму 1+x+x**2+...+x**n.

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n) (то есть должен содержать только один цикл).

Входные данные
Программа получает на вход целое число n и действительное число x.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4
0.1
выходные данные
1.1111

i    - 1      2         3               4(n)
sum  1 1+x    1+x+x**2  1+x+x**2+x**3   1+x+x**2+x**3+x**4
item x x**2   x**3      x**4            x**5

-  1.0 0.1
1  1.1 1e-2
2  1.11 1e-3
3  1.111 1e-4
4  1.1111 1e-5

Алгоритм 5O: В начале прибавляем к сумме элемент, затем вычисляем следующий элемент.
Алгоритм 5О_v2: Вычисляем новый член ряда, затем добавляем его к сумме.
i    - 1     2         3               4(n)
item 1 x   x**2      x**3             x**4
sum  1 1+x 1+x+x**2  1+x+x**2+x**3   1+x+x**2+x**3+x**4
*/

let n = 4;//parseInt(prompt('Введите число'));
let x = 0.1;//parseInt(prompt('Введите число'));
let sum = 1.0;
let item = 1;
for(let i = 1; i<=n; i++) {
    item*=x;
    sum+=item;
}
console.log(sum);