/*
5O.js 31.08.2019
Забудьте формулу суммы геометрической прогрессии и вычислите сумму 1+x+x**2+...+x**n.

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n) (то есть должен содержать только один цикл).

Входные данные
Программа получает на вход целое число n и действительное число x.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
4
0.1
выходные данные
1.1111
*/
var n = 4;
var x = 0.1; // Входные данные, х - из условия.
var sum = 0.; // Сумма элементов.
var elem = 1.; // Очередной элекмент который прибавляется к сумме на кажлом шаге.
for (var i = 1; i <= n; i++) {
    sum += elem;
    elem *= x;
}
console.log(sum);