/*
5P.js 18.10.2020
По данному числу n вычислите сумму 4(1−1/3+1/5−1/7+...+(−1)^n/2n+1)

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n).


Входные данные
Вводится натуральное число.
2
Выходные данные
Выведите ответ на задачу.
3.46667
i   1   5   9   13  17
n   1   2   3   4   5
end 1   6   6   10  10
if  1 
*/

let n = 2;
let end = (n % 2 == 0 ? 2 * (n + 1) : 2 * n);
let sum = 0;

for (let i = 1; i <= end; i += 4) {
    sum += 4 / i;
    if (i == end - 1 && n % 2 == 0) break;
    sum -= 4 / (i + 2);
}

console.log(sum);


