/*
5Q.js 19.10.2020
По данному целому числу n и действительному числу x вычислите сумму 1+x/1!+x^2/2!+x^3/3!+...+x^n/n!

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n).

Примечание
Этот ряд сходится к ex при росте n.

Входные данные
Вводятся натуральное число n и действительное число x.
2                   10                  100
0.1                 0                   1
Выходные данные
Выведите ответ на задачу.
1.105               1                   2.71828
*/

function processing(n, x) {
    let sum = 0;
    for (let i = 0, chis = 1, znam = 1; i <= n; chis *= x, znam *= ++i) {
        sum += chis / znam;
    }
    console.log(sum);
}

let n = 100;
let x = 1;
processing(n, x);







