/*
По данному целому числу n и действительному числу x вычислите сумму 1+x/1!+x**2/2!+x**3/3!+...+x**n/n!

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n).

Входные данные
Вводятся натуральное число n и действительное число x.

Выходные данные
Выведите ответ на задачу.

Примечание
Этот ряд сходится к e**x при росте n.

Примеры
входные данные
2
0.1
выходные данные
1.105
входные данные
10
0
выходные данные
1
входные данные
100
1
выходные данные
2.71828

i        1      2(n)
product  x      x**2
el       1!     2!
sum      1+x/1! 1+x/1!+x**2/2!
*/

let n = 2;//parseInt(prompt('Введите число'));
let x = 0.1;//parseInt(prompt('Введите число'));
let answ = 1;
for(let i = n; i>=1; i--) {
    answ = 1+x*answ/i;
}
console.log(answ);