/*
5Q.js 31.08.2019
По данному целому числу n и действительному числу x вычислите сумму 1+ x/1! + x**2/2! + x**3/3! + ... x**n/n!
Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n).
Входные данные
Вводятся натуральное число n и действительное число x.
Выходные данные
Выведите ответ на задачу.
Примечание
Этот ряд сходится к e**x при росте n.
Примеры
входные данные
2
0.1
выходные данные
1.105
входные данные
10
0
выходные данные
1
входные данные
100
1
выходные данные
2.71828
i   до цикла    1       2       3       4        5       6       7       8       9       10
chis     1     0.1      0.01
znam     1      1       2
sum      1     1.1      1.105
*/
var n = 2;
var x = 0.1;
var sum = 1; // Первый член ряда равен единице, далее chis умножаем на x, znam на i.
for (var i = 1, chis = 1, znam = 1; i <= n; i++) {
    chis *= x;
    znam *= i;
    sum += chis/znam;
}
console.log(sum);