/*
По данному целому числу n и действительному числу x вычислите сумму 1−x**2/2!+x**4/4!−x**6/6!+...+(−1)**n*x**2n/(2n)!

Операцией возведения в степень пользоваться нельзя. Алгоритм должен иметь сложность O(n).

Входные данные
Вводится натуральное число n и действительное число x.

Выходные данные
Выведите ответ на задачу.

Примечание
Этот ряд сходится к cosx  при росте n (углы измеряются в радианах).

Примеры
входные данные
2
0.1
выходные данные
0.995004
входные данные
10
0
выходные данные
1
входные данные
50
3.14159
выходные данные
-1
*/

let n = 2;//parseInt(prompt('Введите число'));
let x = 0.1;//parseInt(prompt('Введите число'));
let sum = 0;
let el = 1;
for(let i = 1; i<=n+1; i++) {
   sum+=el;
   el*=-x*x/(2*i*(2*i-1));
}
console.log(sum);