/*
5T.js 25.10.2020
Дан многочлен P(x)= a(n) * x**n + a(n-1) * x** (n-1) + … + + a(2) * x **2 + a(1) * x + a(0) и число x. 
Вычислите значение этого многочлена, воспользовавшись схемой Горнера:

P(x)=(..(((a(n)*x+a(n-1))*x+a(n-2))*x+a(n-3))..)*x+a(0) 

Входные данные
Сначала программе подается на вход целое неотрицательное число n≤20, затем действительное число x, 
затем следует n+1 вещественное число — коэффициенты многочлена от старшего к младшему.
1                   2
0.000               0.500
1.000               1.000
1.000               1.000
                    1.000
Выходные данные
Программа должна вывести значение многочлена.
1                   1.75
Основная процедура занимается вводом и выводом. 
Функция processing() решает задачу.
*/

function processing(n, x) { // 2 переменные или answ
    let ans = Number(prompt('Старший коэффициент'));
    for (let i = n; i > 0; i--) {
        ans = ans * x + Number(prompt('Коэффициент'));
    }
    return ans;
}

function test() {
    let n = 2;
    let x = 0.500;
    console.log(processing(n, x));
}

function testBrowser() {
    let n = Number(prompt('Сколько коэффициентов?'));
    let x = Number(prompt('х'));
    alert(processing(n, x));
}

test();











