/*
5V.js 30.10.2020
Даны числа a, b, c, d, e, f. Решите систему линейных уравнений

{ax+by=e,
{cx+dy=f.

Входные данные
Вводятся шесть чисел - коэффициенты уравнений системы.
1
0
0
1
3
3
Выходные данные
Вывод программы зависит от вида решения этой системы.

Если система не имеет решений, то программа должна вывести единственное число 0.

Если система имеет бесконечно много решений, каждое из которых имеет вид y=kx+b, то программа должна вывести число 1, 
а затем значения k и b.

Если система имеет единственное решение (x0,y0), то программа должна вывести число 2, а затем значения x0 и y0.

Если система имеет бесконечно много решений вида x=x0, y — любое, то программа должна вывести число 3, а затем значение x0.

Если система имеет бесконечно много решений вида y=y0, x — любое, то программа должна вывести число 4, а затем значение y0.

Если любая пара чисел (x,y) является решением, то программа должна вывести число 5.
3 3

http://www.bymath.net/studyguide/alg/sec/alg15.html

 Сложение или вычитание. Этот метод состоит в следующем.            
1)  Умножаем обе части 1-го уравнения системы (1) на  (– d ), а обе части 2-го уравнения на  а  и складываем их:
                                           

    Отсюда получаем: y = ( af – cd ) / ( ae – bd ).  
2)  Подставляем найденное для  y  значение в любое уравнение системы (1):  

                                 ax + b( af – cd ) / ( ae – bd ) = c.

3)  Находим другое неизвестное:   x = ( ce – bf ) / ( ae – bd ).

Итого, решение в общем виде:
x = ( ce – bf ) / ( ae – bd )
y = ( af – cd ) / ( ae – bd )
Делитель в обоих случаях одинаковый!
./;


ПЕРВОЕ УРАВНЕНИЕ.
Если a=0  - прямая горизонтальна
Если b=0  - прямая вертикальна
Если a=0 И b=0 - уравнение 0 = c. Если c=0 - бесконечно решений 1 уравнения (решение - вся плоскость). Если нет - 0 решений первого уравнения (и всей системы тоже 0).
Если ПЕРВОГО и ВТОРОЕ уравнение прямые - решение:
если прямые пересекаются - 1 решение
если прямые параллельны - либо 0 решений, либо они совпадают и бесконечное множество решений.
У параллельных прямых коэф.наклона одинаковый.  В уравнении = kx+b k - коэф. наклона.
Если одно уравнение ПЛОСКОСТЬ, а другое - ПРЯМАЯ: бесконечно решений.
Помните что делить на 0 нельзя!

*/

let a = 1;
let b = 0;
let c = 0;
let d = 1;
let e = 3;
let f = 3;
let eps = 1E-15;

if (a == 0 && b == 0 && e != 0 || c == 0 && d == 0 && f != 0) { // хотя бы одно из уравнений - пустое множество
    console.log(0);
} else if (a == 0 && b == 0 && e == 0) {                        // первое уравнение - вся плоскость
    if (c == 0) {                                               // второе уравнение - горизонтальная прямая y = y0
        console.log(4, f / d);
    } else if (d == 0) {                                        // второе уравнение - вертикальная прямая x = x0
        console.log(3, f / c);                                  
    } else if (c == 0 && d == 0 && f == 0) {                    // второе уравнение - вся плоскость
        console.log(5);
    } else {
        console.log(1, -c / d, f / d);
    }  
} else if ()
//  {ax+by=e,   y = e/b - a/b*x,    x = e/a - b/a * y 
//  {cx+dy=f.   y = f/d - c/d*x.    x = f/c - d/c * y










