'''
Даны числа a, b, c, d, e, f. Решите систему линейных уравнений

 ax+by=e
 cx+dy=f   
Входные данные
Вводятся 6 чисел - коэффициенты уравнений.

Выходные данные
Вывод программы зависит от вида решения этой системы.

0) Если система не имеет решений, то программа должна вывести
    единственное число 0.
1) Если система имеет бесконечно много решений, каждое из которых имеет вид
    y=kx+b, то программа должна вывести число 1, а затем значения k и b.
2) Если система имеет единственное решение (x0, y0), то программа должна вывести
    число 2, а затем значения x0 и y0.
3) Если система имеет бесконечно много решений вида x=x0, y — любое,
    то программа должна вывести число 3, а затем значение x0.
4) Если система имеет бесконечно много решений вида y=y0, x — любое,
    то программа должна вывести число 4, а затем значение y0.
5) Если любая пара чисел (x, y) 
    является решением, то программа должна вывести число 5.

Примеры
входные данные
1
0
0
1
3
3
выходные данные
2 3 3
входные данные
1
1
2
2
1
2
выходные данные
1 -1 1
входные данные
0
2
0
4
1
2
выходные данные
4 0.5


http://www.bymath.net/studyguide/alg/sec/alg15.html

 Сложение или вычитание. Этот метод состоит в следующем.            
1)  Умножаем обе части 1-го уравнения системы (1) на  (– d ), а обе части 2-го уравнения на  а  и складываем их:

                                           

    Отсюда получаем: y = ( af – cd ) / ( ae – bd ).  
2)  Подставляем найденное для  y  значение в любое уравнение системы (1):  

                                 ax + b( af – cd ) / ( ae – bd ) = c.

3)  Находим другое неизвестное:   x = ( ce – bf ) / ( ae – bd ).

Итого, решение в общем виде:
x = ( ce – bf ) / ( ae – bd )
y = ( af – cd ) / ( ae – bd )
Делитель в обоих случаях одинаковый! ТУТ ДРУГИЕ БУКВЫ ЧЕМ В ЗАДАЧЕ, 1: abc. 

'''

a=float(input())
b=float(input())
c=float(input())
d=float(input())
e=float(input())
f=float(input())
if a==0 and b==0 and c==0 and d==0 and e==0 and f==0: # Решение - вся плоскость
    print(5)
elif a*d==b*c and a*f!=c*e: # Прямые параллельны, но не совпадают. Решений нет.
    print(0)
elif a==0 and b==0 and e!=0: # Первое уравнение не имеет решений
    print(0)
elif c==0 and d==0 and f!=0: # Второе уравнение не имеет решений
    print(0)
elif a==0 and c==0 and b*f!=d*e: # Горизонтальные прямые параллельны,но не совпадают.Решений нет.
    print(0)
elif b==0 and d==0 and a*f!=c*e: # Вертикальные прямые параллельны,но не совпадают.Решений нет.
    print(0)
elif a*d==b*c and a*f==c*e: # Знаменатель дроби 5U равен 0, числитель у Y равен 0. 
    if b==0 and d==0: # Система вырождается в ax = e И cx = f, в две вертикальные прямые.
        if a!=0 and c!=0: # система имеет бесконечно много решений вида x=x0, y — любое
            print(3,e/a)  # Печатаем x0
        elif a==0:
            if e==0:
                print(3,f/c) # Печатаем x0
        elif c==0:
            if f==0:
                print(3,e/a) # Печатаем x0
    elif a==0 and c==0: # система имеет бесконечно много решений вида y=y0, x — любое
        if b!=0:
            print(4,e/b) # Печатаем y0
        elif d!=0:
            print(4,f/d) # Печатаем y0
    elif b!=0: # Две прямые совпадают, решение вида y=kx+b, печатаем k и b.
        print(1,-a/b, e/b)
    elif d!=0: # Две прямые совпадают, решение вида y=kx+b, печатаем k и b.
        print(1,-c/d,f/d)
else: # Знаменатель дроби 5U не равен 0 - одно решение, одна точка x,y.
    x=(e*d-b*f)/(a*d-b*c)
    y=(a*f-e*c)/(a*d-b*c)
    print(2,x,y)
