'''
Даны числа a, b, c, d, e, f. Решите систему линейных уравнений

 ax+by=e
 cx+dy=f   
Входные данные
Вводятся 6 чисел - коэффициенты уравнений.

Выходные данные
Вывод программы зависит от вида решения этой системы.

Если система не имеет решений, то программа должна вывести единственное число 0.

Если система имеет бесконечно много решений, каждое из которых имеет вид
y=kx+b, то программа должна вывести число 1, а затем значения k и b.

Если система имеет единственное решение (x0y0), то программа должна вывести
число 2, а затем значения x0 и y0.

Если система имеет бесконечно много решений вида x=x0, y — любое, то программа
должна вывести число 3, а затем значение x0.

Если система имеет бесконечно много решений вида y=y0, x — любое, то программа
должна вывести число 4, а затем значение y0.

Если любая пара чисел (xy)  является решением, то программа должна вывести
число 5.

Примеры
входные данные
1
0
0
1
3
3
выходные данные
2 3 3
входные данные
1
1
2
2
1
2
выходные данные
1 -1 1
входные данные
0
2
0
4
1
2
выходные данные
4 0.5

mink 100%
'''

a=float(input())
b=float(input())
c=float(input())
d=float(input())
e=float(input())
f=float(input())
if a==0 and b==0 and c==0 and d==0 and e==0 and f==0:
    print(5)
elif a*d==b*c and a*f!=c*e:
    print(0)
elif a==0 and b==0 and e!=0:
    print(0)
elif c==0 and d==0 and f!=0:
    print(0)
elif a==0 and c==0 and b*f!=d*e:
    print(0)
elif b==0 and d==0 and a*f!=c*e:
    print(0)
elif a*d==b*c and a*f==c*e:
    if b==0 and d==0:
        if a!=0:
            if c!=0:
                print(3,e/a)
            else:
                if f==0:
                    print(3,e/a)
        else:
            if e==0:
                print(3,f/c)
    elif a==0 and c==0:
        if b!=0:
            print(4,e/b)
        elif d!=0:
            print(4,f/d)
    elif b!=0:
        print(1,-a/b, e/b)
    elif d!=0:
        print(1,-c/d,f/d)
else:
    x=(e*d-b*f)/(a*d-b*c)
    y=(a*f-e*c)/(a*d-b*c)
    print(2,x,y)
