/*
13E.js 11.11.2020. 
Для данного символа, считанного со стандартного ввода, проверьте, является ли он цифрой. 
Решение оформите в виде функции IsDigit(c), возвращающей значение типа bool. В решении нельзя использовать циклы. 
В решении нельзя использовать константы с неочевидным значением типа 48 или 57.
Входные данные
Вводится один символ
b       4
Программа должна вывести слово YES, если символ является цифрой, или слово NO.
NO      YES
*/

function IsDigit(c) {
    return c >= '0' && c <= '9';
}

let c = 'c';
console.log(IsDigit(c) ? 'YES' : 'NO');