/*
13F.js 11.11.2020. 
Напишите функцию ToUpper(c), которая переводит символ в верхний регистр, 
то есть для строчной буквы латинского алфавита возвращает соответствующую заглавную букву латинского алфавита, 
а для остальных символов возвращает тот же символ.

Входные данные
Считайте один символ со стандартного ввода

Выходные данные
Переведите считанный символ в верхний регистр. В решении нельзя использовать циклы. 
В решении нельзя использовать константы с неочевидным значением.
*/

function ToUpper(c) {
    return c.toUpperCase();
}

let c = 'r';
console.log(ToUpper(c));