/*
13G.js 11.11.2020. 
Напишите функцию CaseChange (c), меняющую регистр символа, то есть переводящую заглавные буквы в строчные, 
а строчные - в заглавные, остальные символы не меняющие. В решении нельзя использовать циклы. 
В решении нельзя использовать константы с неочевидным значением.

Входные данные
Считайте один символ со стандартного ввода
b   c   F
Выходные данные
Выведите результат работы данной функции
B   C   f
*/

function CaseChange(c) {
    return (c != c.toUpperCase() ? c.toUpperCase() : c.toLowerCase());
}

let c = 'f';
console.log(CaseChange(c));