    /*
13G.js 12.11.2020
Напишите функцию CaseChange (c), меняющую регистр символа, 
то есть переводящую заглавные буквы в строчные, а строчные - в заглавные, 
остальные символы не меняющие. В решении нельзя использовать циклы. 
В решении нельзя использовать константы с неочевидным значением.
Входные данные
Считайте один символ со стандартного ввода
Выходные данные
Выведите результат работы данной функции
Примеры
входные данные
b
выходные данные
B
входные данные
c
выходные данные
C
входные данные
F
выходные данные
f
*/

// Принимает входные данные задачи, возвращает ответ. 
function CaseChange(n) {
   return isUpper(n) ? n.toLowerCase() : n.toUpperCase();
}

function isUpper(n) {
    return 'A' <= n && n <= 'Z';    // интервал заглавных латинских букв
}

// Ввод-вывод консольный, тестовый
function interfaceTest() {
    let n = '1';
    console.log(CaseChange(n));    
}

interfaceTest();