/*
13I.js 11.11.2020. 
Дано слово, состоящее только из заглавных и строчных латинских букв. 
Проверьте, верно ли что это слово читается одинаково как справа налево, так и слева направо (то есть является палиндромом), 
если считать заглавные и строчные буквы не различающимися. Выведите слово YES, если слово является палиндромом и слово NO, если не является.

Решение оформите в виде функции IsPalindrome (S), возвращающей значение типа bool. 
При решении этой задачи нельзя пользоваться вспомогательными массивами или строками.

входные данные
Radar       YES

выходные данные
YES         NO
*/

function IsPalindrome(S) {
        return (S.toUpperCase().split('').reverse().join('') == S.toUpperCase());
}

let S = 'yeY';
console.log(IsPalindrome(S) ? "YES" : "NO");