/*
13I.js 17.11.2020
Дано слово, состоящее только из заглавных и строчных латинских букв. 
Проверьте, верно ли что это слово читается одинаково как справа налево, 
так и слева направо (то есть является палиндромом), если считать заглавные и строчные буквы не различающимися. 
Выведите слово YES, если слово является палиндромом и слово NO, если не является.
Решение оформите в виде функции IsPalindrome (S), возвращающей значение типа bool. 
При решении этой задачи нельзя пользоваться вспомогательными массивами или строками.
Примеры
входные данные
Radar
выходные данные
YES
входные данные
YES
выходные данные
NO
*/

// ВСЁ РЕШЕНИЕ. Принимает входные данные задачи, возвращает ответ. 
function processing(str) {
    return IsPalindrome(str) ? 'YES' : 'NO';
}

// ДВИЖОК. Поиск до первого несовпадения. Применяет правило.
function IsPalindrome(str) {
    for(let i = 0; i < str.length/2; ++i) { // Идём с начала до середины и с конца до середины строки.
        if (!isSame(str[i], str[str.length-1-i])) 
            return false;   // Проверка до первого несовпадения
    }
    return true; // Все проверки пройдены успешно.
}

// ПРАВИЛО. Принимает на вход два символа и сравнивает их с учетом регистра, возвращает тип boolean. 
function isSame(n, m) {
    return n.toLowerCase() == m.toLowerCase();
}

// АВТО ТЕСТ. Ввод-вывод консольный, тестовый
function interfaceTest() {
    console.log(processing('Radar'));
    console.log(processing('RadaK'));
}

interfaceTest();
