/*
13J.js 11.11.2020. 
Дана строка, возможно, содержащая пробелы. Извлеките из этой строки все символы, являющиеся цифрами и составьте из них новую строку. 
Решение оформите в виде функции ExtractDigits (S)

входные данные
Программа получает на вход исходную строку S
2+2=4

выходные данные
Требуется вывести новую строку, содержащую только цифры данной строки.
224
*/

function ExtractDigits(S) {
        return S.split('').filter(item => isNumber(item)).join('');                                                 
}

function isNumber(char) {
        return (char >= '0' && char <= '9');
}

let S = '2+2=4';
console.log(ExtractDigits(S));