/*
13K.js 18.11.2020. 
Дана строка, состоящая из n цифр (т.е. однозначных чисел), между которыми стоит n−1 знак операции, 
каждый из которых может быть либо +, либо -. Вычислите значение данного выражения.

Решение оформите в виде функции Evaluate(S), где S - строка с выражением, 
а возвращаемое значение функции - результат вычисления этого выражения.

входные данные
1+2-3

выходные данные
0
*/

function Evaluate(S) {
        let out = Number(S[0]);
        for (let i = 1; i < S.length; i += 2) {
                if (S[i] == '+') out += Number(S[i + 1]);
                else out -= Number(S[i + 1]); 
        }
        return out;
}

let S = '2+2-3+4-3';
console.log(Evaluate(S));