'''Дана строка, возможно, содержащая пробелы.
Определите количество слов в этой строке.
Слово — это несколько подряд идущих букв латинского алфавита
(как заглавных, так и строчных).

Решение оформите в виде функции CountWords (S), возвращающее значение типа int.
При решении этой задачи нельзя пользоваться дополнительными строками и списками.

Примеры
входные данные
Yesterday, all my troubles seemed so far away
выходные данные
8

СЧИТАЕМ что слово - более 1 буквы.'''
def IsLetter(ch):
    return 'a'<=ch<='z' or 'A'<=ch<='Z'

def CountWords(s):
    s+='.'
    res=0
    for i in range(len(s)-2):
        if IsLetter(s[i]) and IsLetter(s[i+1]) and not IsLetter(s[i+2]):
            res+=1 # считываем только концы слов
    return res

print(CountWords(input()))

