/*
13P.js 07.12.2020. 
Капитан Флинт зарыл клад на Острове сокровищ. Он оставил описание, как найти клад. 
Описание состоит из строк вида: “North 5”, где первое слово – одно из “North”, “South”, “East”, “West”, 
а второе число – количество шагов, необходимое пройти в этом направлении.

Напишите программу, которая по описанию пути к кладу определяет точные координаты клада, считая, 
что начало координат находится в начале пути, ось OX направлена на восток, ось OY – на север.

Входные данные
Программа получает на вход последовательность строк указанного вида, завершающуюся строкой со словом “Treasure!”.

выходные данные
groundВыходные данные
Программа должна вывести два целых числа: координаты клада. Например, при входных данных : 
North 5

East 3

South 1

Treasure!

программа должна вывести координаты 3 4
*/

function search(step) {
       let OX = 0;
       let OY = 0;
       for (let item of step) {
              switch(item[0]) {
                     case 'N':
                            OY += Number(item.slice(5));
                            break;
                     case 'S':
                            OY -= Number(item.slice(5));
                            break;
                     case 'E':
                            OX += Number(item.slice(4));
                            break;
                     case 'W':
                            OX -= Number(item.slice(4));
              }
       }
       return `${OX} ${OY}`;
}

const coords = ['North 5', 'East 3', 'South 1', 'Treasure'];
console.log(search(coords));






