/*
13P.js 26.11.2020
Капитан Флинт зарыл клад на Острове сокровищ. Он оставил описание, как найти клад. 
Описание состоит из строк вида: “North 5”, где первое слово – одно из “North”, “South”, “East”, “West”, 
а второе число – количество шагов, необходимое пройти в этом направлении.
Напишите программу, которая по описанию пути к кладу определяет точные координаты клада, 
считая, что начало координат находится в начале пути, ось OX направлена на восток, ось OY – на север.
Входные данные
Программа получает на вход последовательность строк указанного вида, завершающуюся строкой со словом “Treasure!”.
Выходные данные
Программа должна вывести два целых числа: координаты клада. Например, при входных данных : North 5
East 3
South 1
Treasure!
программа должна вывести координаты 3 4
Примеры
входные данные
North 5
East 3
South 1
Treasure!
выходные данные
3 4
*/


// const splits = myString.split(/(\d)/)     // Разделение по цифрам включая цифры
let x = 0, y = 0, s = prompt();
while (s != 'Treasure!') {
    let arr = s.split(' ');
    console.log(s, arr);
    if (arr[0] == 'North')
        y += Number(arr[1]);
    else if (arr[0] == 'South')
        y -= Number(arr[1]);
    else if (arr[0] == 'East')
        x += Number(arr[1]);
    else
        x -= Number(arr[1]);
    s = prompt();
}
console.log(x, y);
