/*
13T.js 11.12.2020. 
Дана строка, возможно, содержащая пробелы. 
Определите, какая буква латинского алфавита (или какие буквы) в этой строке встречается чаще всего. 
При решении этой задачи заглавные и строчные буквы считаются одинаковыми, а прочие символы, не являющиеся буквами, 
не учитываются.

Программа должна вывести в первой строке все буквы, которые встречаются чаще всего в исходной строке. 
Выводить буквы необходимо в заглавном написании, в алфавитном порядке, без пробелов. 
Во второй строке выведите единственное число - сколько раз в данной строке встречаются эти буквы.

При решении этой задачи нельзя пользоваться вложенными циклами. Входная строка должна обрабатываться за один проход.

входные данные
- We all live in the Yellow Submarine!
выходные данные
EL
5

по времени O(N^2)
*/

// Предикат для определения латинских букв (как заглавных, так и строчных).
function isAlpha(letter) {
       return 'A'<=letter && letter<='Z' || 'a'<=letter && letter<='z';
}

// перебор строки
function cntLetter(S) {
    let str = '';
    let max = 0;
    let set = new Set(S);
    for (let letter of set) {   
        if (isAlpha(letter)) {
            let cnt = S.split(letter).length - 1;   // количество букв в строке
            if (max < cnt) {
               max = cnt;
               str = letter;
            } else if (max == cnt) {
                str += letter;
            }
        }
    }    
    return [str, max];   
}

// Ввод и вывод данных
function interface() { 
    let S = '- We all live in the Yellow Submarine!';
    console.log(`${cntLetter(S)[0].toUpperCase()}\n${cntLetter(S)[1]}`);
}

interface();




