/*
13V.js 14.12.2020. 
В сети интернет каждому компьютеру присваивается четырехбайтовый код, который принято записывать в виде четырех чисел, 
каждое из которых может принимать значения от 0 до 255, разделенных точками. Вот примеры правильных IP-адресов:

127.0.0.0 192.168.0.1 255.0.255.255

входные данные
Программа получает на вход строку из произвольных символов.
127.0.0.1
выходные данные
Если эта строка является корректной записью IP-адреса, выведите YES, иначе выведите NO.
YES

Ошибки: не проверяется, что 
- элемент массива не пуст
- элемент имеет тип Number
- Number целый
- элемент >= 0
- нет пробелов и табуляций и символов новой строки до цифры в квадранте
- нет лидирующих нулей (если октет не 0)
0 как первая цифра допустим только если это первая И ЕДИНСТВЕННАЯ цифра.
*/

// перебор строки
function isIP(S) {
    let re = /(?:(?:[0-9]|[0-9][0-9]|1[0-9][0-9]|25[0-5]|2[0-4][0-9]?)\.){3}(?:25[0-5]|[0-9]|[0-9][0-9]|1[0-9][0-9]|2[0-4][0-9]?)/;
    return S.replace(re, '') == '' ? true : false;
}

console.log(isIP('255.0.1.255'));
console.log(isIP('.0.1.255'));       // NO
console.log(isIP('-255.0.1.255'));   // NO
console.log(isIP('1. 0.1.255'));     // NO
console.log(isIP('255.0.11 .255'));  // NO
console.log(isIP('255.0.11A.255 '));
console.log(isIP('255.0.11.0255')); // NO
// Ввод и вывод данных
// function interface() { 
//     let S = '255.0.1.255';
//     console.log(isIP(S));
// }

// interface();




