/*
13W.js 14.12.2020. 
Хорошо известна задача-шутка, в которой требуется продолжить числовой ряд:
1 11 21 1211 111221 312211 13112221 1113213211 ...

Входные данные
Вводится одно число k≤25
4
Выходные данные
Выведите одно число - k-е число в этом ряду
1211
*/

// По числу k<=25 вернуть результат k-е число в этом ряду в виде строки.
function result(k) {
    let i = 1;
    let prev = '1';
    while (i < k) {
        prev = play(prev);
        i++;
    }
    return prev;
}

// Получает очередное число в виде строки по предыдущему в виде строки.
function play(prev) {
    let next = '';
    for (let i = 0, cnt = 1; i < prev.length; i++) {
        if (prev[i] == prev[i + 1]) {
            cnt++;
        } else {
            next += cnt + prev[i];
        }
    }
    return next;
}

let k = 4;
console.log(result(k));



