/*
13X.js 16.12.2020. 
Дана текстовая строка, содержащая буквы латинского алфавита, пробелы, запятые и точки. 
Отформатируйте этот текст по следующим правилам:

1) В начале и конце строки не должно быть пробелов.
2) Все слова разделяются ровно одним пробелом.
3) Точки и запятые пишутся слитно с предыдущим словом, после знака препинания ставится пробел.

Выведите полученную строку.
Входные данные
        Hello , world.
Выходные данные
Hello, world.
*/

// движок
function processig(str) {
    return triming(spacing(punct(str)));
}

// правило: убирает пробелы в начале и конце строки
function triming(str) {
    return str.trim();
}

// правило: все слова разделяются одним пробелом
function spacing(str) {
    return str.split(' ').filter(item => item).join(' ');
}

// правило: точки и запятые пишутся слитно с предыдущим словом, после знака препинания ставится пробел.
function punct(str) {       
    function deleteSpaces(item) {
        return item.trim() + ' '; // убирает пробелы у каждого item
    }
    return str.replace(/\s*[.,]\s*/g, deleteSpaces);
}

// интерфейс
let k = '    Hello ,  my    wor.ld.   ';
console.log(processig(k));



