'''
Дано слово, состоящее только из строчных латинских букв. Определите, какое
наименьшее число букв нужно дописать к этому слову справа так, чтобы оно стало
палиндромом.

Примеры
входные данные
abcd
выходные данные
3
входные данные
abb
выходные данные
1

Олег П.
По памяти О(n)
По времени О(n**2)

100%
'''

'''
Принимает строку, проверяет является ли строка палиндромом, если нет, то отсекает
одну букву слева, иначе возвращает, то сколько мы уже отсекли от нашей строки.
'''
def Mech(st):
    for  i in range(len(st)):
            if IsPalindrome(st[i:]):
                return i
    return len(st)-1

# Проверяет является ли строка палиндромом.
def IsPalindrome(st):
    return st[::-1]==st

print(Mech(input()))  
